{
  "gameVersion": "1.5.97",
  "tasks": [
    {
      "name": "abil",
      "description": "Grants ability points to all actions (abilities) from all selectable classes in the game. Iterates through each selectable class and modifies the player's actor value for each action in that class by the specified amount (default 9 points if not specified).",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The number of ability points to grant for each action. Defaults to 9 if not provided or if less than 1 element in the floats array."
        }
      ]
    },
    {
      "name": "action",
      "description": "Executes a game action at a specified location or on a specified actor. If only one string is provided, casts the action on the task's actor at their position. If two strings are provided, the second string specifies which actor should use the action. The action can be executed at a specific tile coordinate if provided, otherwise uses the actor's current position.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the action to execute"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The ID of the actor who should perform the action. If empty or actor doesn't exist, uses the task's actorID or specified tile coordinate"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate where the action should be executed. If not provided and no valid actor in strings[1], uses the task actor's position"
        }
      ]
    },
    {
      "name": "actionOnPartyNumActor",
      "description": "Executes a specified action on a party member at a specific index position. The action is cast at the party member's current position, targeting that same position. Only executes if the party has enough members to include the specified index.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the action to execute on the party member"
        },
        {
          "name": "floats[0]",
          "description": "The zero-based index of the party member in the partyActors list to target with the action"
        }
      ],
      "optional": []
    },
    {
      "name": "add50gp",
      "description": "Adds exactly 50 gold pieces to the player's money. This is a simple, fixed-value money addition with no parameters.",
      "required": [],
      "optional": []
    },
    {
      "name": "addgp",
      "description": "Adds gold pieces to the player's money. Can either use a formula string to calculate the amount dynamically, or use a fixed float value. The formula is evaluated using the player actor as context and the result is floored to an integer.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "A formula string to calculate the amount of gold to add. Takes precedence over floats[0] if both are provided. The formula is evaluated with the player actor as the target."
        },
        {
          "name": "floats[0]",
          "description": "A fixed amount of gold to add. Only used if strings[0] is not provided or the strings array is empty."
        }
      ]
    },
    {
      "name": "addIconToCurrentLocation",
      "description": "Adds a tooltip icon to the player's current location. This icon will be displayed in the location's tooltip when viewing it on the map or in location interfaces.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID or name of the icon to add to the current location's tooltipIcons list"
        }
      ],
      "optional": []
    },
    {
      "name": "addItem",
      "description": "Adds an item to the game world, an actor's inventory, or the player's cargo/stash. The item can be placed at a specific tile coordinate, given to a specified actor, or added to the task's actor. Cargo items go to cargo inventory, other items go to actor inventory or stash. Handles overflow by dropping items on the ground. For actors, only adds the quantity needed if they already have some of the item.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The item type ID to create and add"
        },
        {
          "name": "floats[0]",
          "description": "The quantity of the item to add."
        },
        {
          "name": "bools[0]",
          "description": "Used when adding item at a tile coordinate - if true, forces the item to fit at that location"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The ID of a specific actor to give the item to. If provided and the actor exists, the item is equipped to that actor instead of using default behavior"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate where the item should be placed. If provided, overrides all other placement logic and drops the item at this location"
        }
      ]
    },
    {
      "name": "addItemToContainer",
      "description": "Adds an item to a container at a specific tile coordinate. Searches all items at the specified tile for a container item, optionally filtering by a specific container item ID. The item is only added if the container can fit it.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The item type ID to create and add to the container"
        },
        {
          "name": "floats[0]",
          "description": "The quantity of the item to add to the container."
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The specific container item ID to add items to. If empty or not provided, uses the first available container at the tile that can fit the item"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate where the container is located. Required for this task to do anything - task does nothing if not provided"
        }
      ]
    },
    {
      "name": "addJournalGoal",
      "description": "Adds a goal to the player's journal by storing it in global variables goal0-goal19. Concatenates all string parameters with commas to form the complete goal text. Checks if the goal already exists or finds an empty slot. When successfully added, refreshes the journal UI, makes it visible, and plays visual and sound effects.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The primary goal text or first part of the goal. Additional strings are appended with commas to form the complete goal"
        }
      ],
      "optional": [
        {
          "name": "strings[1+]",
          "description": "Additional parts of the goal text. All non-empty strings from index 1 onward are concatenated to strings[0] with comma separators to build the full goal text"
        }
      ]
    },
    {
      "name": "addLocationUnlockable",
      "description": "Adds an unlockable item or feature to the current location with a specified cost. After adding the unlockable, attempts to immediately unlock items at the location without displaying the unlock notification. Used for adding purchasable upgrades or features to locations.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID or identifier of the unlockable to add to the current location"
        },
        {
          "name": "floats[0]",
          "description": "The cost required to unlock this feature (typically in gold)"
        },
        {
          "name": "strings[1]",
          "description": "Additional parameter for the unlockable (purpose depends on the specific unlockable type)"
        }
      ],
      "optional": []
    },
    {
      "name": "addTalkerToParty",
      "description": "Adds the task's actor to the player's party as an ally and to the fleet. If the actorID starts with 'hire_', changes the ID to 'hired_' with a unique suffix and forces addition to landing party. Optionally can force addition to landing party via bool parameter. Reduces crew morale by 1 if it's above 70.",
      "required": [],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If true, attempts to add the actor to the landing party in addition to the main party and fleet"
        }
      ]
    },
    {
      "name": "addTalkerToParty_temp",
      "description": "Adds the task's actor to the party as a temporary companion with restricted permissions (cannot edit appearance, loot corpses, or be fully controlled). Copies the player's cloth palette to the actor. Refreshes their actions and in difficulty mode, ensures they have appropriate support abilities for their actor type and class, and may boost ability ranks by 1 point each.",
      "required": [],
      "optional": []
    },
    {
      "name": "addToFleet_andSwapWithFleet_slot",
      "description": "Swaps the task's actor (a boat) with a boat at a specific fleet slot index. The fleet boat is removed from the fleet, its crew transferred to the task's actor, then the task's actor joins the fleet with that crew. The displaced boat is placed near travel_point9 in the zone with its dialog set to 'boat_unmoor' and made uncontrollable. The new boat maintains its position in the fleet order.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The zero-based index of the boat in the player's fleet to swap with the task's actor"
        }
      ],
      "optional": []
    },
    {
      "name": "addToFleet",
      "description": "Adds the task's actor (typically a boat) to the player's fleet. If the actor's dialog is 'boat_unmoor', clears it. Adds the actor to the party and then removes them from the zone without removing from party, effectively moving them to the fleet.",
      "required": [],
      "optional": []
    },
    {
      "name": "addToParty",
      "description": "Adds a specified actor to the player's party. Returns false if the actor doesn't exist in the zone, preventing further task execution. Simple party addition without fleet or landing party modifications.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to add to the party"
        }
      ],
      "optional": []
    },
    {
      "name": "addTreasuresToZone",
      "description": "Spawns a shipwreck treasure at coordinates stored in global variables 'treasureTCX' and 'treasureTCY'. Only executes if treasureTCX is non-zero. Creates a buried shipwreck container with random gold (90-220), cargo_lost, two random loot items (loot3 and loot4), and lost_docs. Clears the treasure coordinate global variables after spawning.",
      "required": [],
      "optional": []
    },
    {
      "name": "addTrigger",
      "description": "Adds a global trigger to the current zone if it exists in the global triggers data and isn't already present in the zone. Creates a new trigger instance from the global trigger definition and assigns it an unused trigger number in the zone.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the global trigger to add to the current zone"
        }
      ],
      "optional": []
    },
    {
      "name": "addZoneFX",
      "description": "Adds a visual or special effect to the current zone. Can optionally check if the effect already exists and skip adding if it does. Uses optional tile coordinates and float parameter for effect positioning or magnitude.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the zone effect to add"
        },
        {
          "name": "floats[0]",
          "description": "A parameter for the zone effect (could be duration, intensity, or other effect-specific value)"
        },
        {
          "name": "bools[0]",
          "description": "If true, only adds the effect if it doesn't already exist in the zone's zoneFX list. If false, adds regardless of existing effects"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Optional tile coordinates for positioning the zone effect. The X and Y values are passed to addZoneFX"
        }
      ]
    },
    {
      "name": "adjustFleetAlliegances",
      "description": "Converts enemy fleet escorts (actors with combat label 'E') from the same faction as the enemy fleet into hostile enemies. Only executes if an enemy fleet exists. Clears the playerEscort global variable, changes their combat label color to enemy fleet color, makes them hostile, and displays red exclamation marks above them.",
      "required": [],
      "optional": []
    },
    {
      "name": "advanceTimers",
      "description": "Advances all game timers by a specified amount. This affects time-based systems and events in the zone. Uses the same float value for both parameters of advanceToNextTimer.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount of time to advance all timers by"
        }
      ],
      "optional": []
    },
    {
      "name": "allc",
      "description": "Unlocks all selectable character classes in the game. For each class, sets its unlock global variable (either from the class's formula requirement or 'class_<classID>'), adds it to known classes list, enables the unlockAllClasses flag, and refreshes the class info UI. Useful for debugging or cheat modes.",
      "required": [],
      "optional": []
    },
    {
      "name": "allclass",
      "description": "Unlocks all selectable character classes in the game. For each class, sets its unlock global variable (either from the class's formula requirement or 'class_<classID>'), adds it to known classes list, enables the unlockAllClasses flag, and refreshes the class info UI. Identical to 'allc' task.",
      "required": [],
      "optional": []
    },
    {
      "name": "allxp",
      "description": "Awards experience points to all party members for all selectable classes. Each party member receives the specified XP amount (default 9999) for every selectable class in the game. Useful for rapidly leveling up the entire party across all classes.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The amount of XP to award for each class to each party member. Defaults to 9999 if not provided"
        }
      ]
    },
    {
      "name": "animate",
      "description": "Plays an animation on an actor and optionally makes them busy for a duration. Can target either the task's actor or a specified actor. If a busy timer is provided, removes stun effects and sets the actor's busy timer to prevent other actions.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the animation to play on the actor"
        },
        {
          "name": "floats[0]",
          "description": "The busy timer duration. If greater than 0, removes stun effects and prevents the actor from taking other actions for this duration"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The ID of the actor to animate. If provided and non-empty, overrides using the task's actorID"
        }
      ]
    },
    {
      "name": "anim",
      "description": "Plays an animation on the player character, clears any debug draw strings, and switches the game mode to travel. Displays an error if no animation name is provided. Simpler than 'animate' task - always targets the player and doesn't support busy timers.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The name of the animation to play on the player. Shows error message if not provided"
        }
      ]
    },
    {
      "name": "appendToGlobalVar",
      "description": "Appends a calculated value to a global variable string. Evaluates a formula and appends the result to the existing string value of the specified global variable. The formula result is converted to a string for concatenation.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to append to"
        },
        {
          "name": "strings[1]",
          "description": "A formula string to calculate the value to append. The formula result is converted to string and concatenated to the global variable's current string value"
        }
      ],
      "optional": []
    },
    {
      "name": "appendToGlobalVar_locID",
      "description": "Appends the current location's ID to a global variable string. Only executes if the player is currently at a location. The location ID is concatenated to the global variable's existing string value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to append the current location ID to"
        }
      ],
      "optional": []
    },
    {
      "name": "appendToGlobalVar_math",
      "description": "Appends a calculated value to a global variable string. Evaluates a formula and appends the result to the existing string value of the specified global variable. Identical to 'appendToGlobalVar' task.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to append to"
        },
        {
          "name": "strings[1]",
          "description": "A formula string to calculate the value to append. The formula result is converted to string and concatenated to the global variable's current string value"
        }
      ],
      "optional": []
    },
    {
      "name": "appendToGlobalVar_string",
      "description": "Appends a literal string value to a global variable string. No formula evaluation - directly concatenates the provided string to the global variable's existing string value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to append to"
        },
        {
          "name": "strings[1]",
          "description": "The literal string value to append to the global variable"
        }
      ],
      "optional": []
    },
    {
      "name": "appendToGlobalVar_zoneID",
      "description": "Appends the current zone's ID to a global variable string. The zone ID is concatenated to the global variable's existing string value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to append the current zone ID to"
        }
      ],
      "optional": []
    },
    {
      "name": "applyElement",
      "description": "Applies an elemental reaction to a single tile. The element type is converted from the string name and applied to the specified tile coordinate, triggering any elemental interactions on that tile.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the element to apply to the tile (e.g., 'fire', 'water', 'ice', etc.)"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate where the element should be applied"
        }
      ],
      "optional": []
    },
    {
      "name": "applyElementToArea",
      "description": "Applies an elemental reaction to a rectangular area of tiles. Iterates through all tiles in the area defined by the starting coordinate and size, applying the element to each. Optionally increments a delay value for each tile to create staggered effects.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the element to apply to each tile in the area"
        },
        {
          "name": "strings[1]",
          "description": "The size of the rectangular area as a TileCoord string (e.g., '5,5' for a 5x5 area)"
        },
        {
          "name": "tileCoords[0]",
          "description": "The top-left corner coordinate of the rectangular area to apply the element to"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "An increment value added to the delay for each tile processed, creating a cascading or staggered element application effect"
        }
      ]
    },
    {
      "name": "applyElementToZone",
      "description": "Applies an elemental reaction to the entire zone using the fast zone-wide element application method. Can optionally pass a boolean parameter to the reaction function for additional behavior control.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the element to apply to the entire zone"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "An optional boolean parameter passed to the reactZoneWithElement_fast function, controlling some aspect of the element application behavior"
        }
      ]
    },
    {
      "name": "askForNewPortName",
      "description": "Opens a text input dialog asking the player to name a port. Switches to travel mode, displays a confirmation window with text input enabled asking 'What will you name the port?', and triggers the 'renamePort' special effect when confirmed. The dialog cannot be closed by the player and clears on turn start.",
      "required": [],
      "optional": []
    },
    {
      "name": "attractAttention",
      "description": "Attracts the attention of nearby actors to a location, making them investigate or become alert. If tile coordinates are provided, uses that location with optional custom distance and affects-all-actors flag. If no coordinates, uses the task actor's position. Default distance is 12 tiles.",
      "required": [],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate to attract attention to. If not provided, uses the task actor's position"
        },
        {
          "name": "floats[0]",
          "description": "The distance radius for attention attraction. Defaults to 12 if not provided or zero"
        },
        {
          "name": "bools[0]",
          "description": "If true, affects all actors always regardless of their state. If false or not provided, uses default behavior"
        }
      ]
    },
    {
      "name": "attractAttentionToPlayer",
      "description": "Attracts the attention of nearby actors to the player's current position, making them investigate or become alert. Uses the player's position as both source and target of attention. Default distance is 12 tiles but can be customized.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The distance radius for attention attraction centered on the player. Defaults to 12 if not provided or zero"
        },
        {
          "name": "bools[0]",
          "description": "If true, affects all actors always regardless of their state. If false or not provided, uses default behavior"
        }
      ]
    },
    {
      "name": "autobuy_food",
      "description": "Automatically purchases food to fill cargo space or spend all available money, whichever is less. Calculates how much food can be bought based on cargo space and available money, deducts the cost, and adds the food to cargo inventory. Uses current food buy price.",
      "required": [],
      "optional": []
    },
    {
      "name": "autosaveASAP",
      "description": "Flags the game to perform an autosave as soon as possible. Sets the ZoneManager's autosaveASAP flag to true, which will trigger an autosave on the next appropriate opportunity.",
      "required": [],
      "optional": []
    },
    {
      "name": "barracksLineup",
      "description": "Arranges all party actors (both active party and barracks) in a grid formation at a specified location. Places actors in rows with configurable spacing, facing right (90 degrees). Active party members are positioned slightly higher. Actors not already in the zone are added. Default spacing is 1 tile, arranged in a 7-wide grid with 4-tile vertical spacing.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The horizontal spacing between actors in the lineup. Defaults to 1 if set to 0 or less. Controls how spread out the grid is"
        },
        {
          "name": "tileCoords[0]",
          "description": "The top-left corner position where the lineup grid starts"
        }
      ],
      "optional": []
    },
    {
      "name": "bezoar_setupportselect",
      "description": "Dynamically populates a dialog node with teleport options to discovered ports in a specific quadrant of the Eral region. Uses directional coordinates to filter ports by quadrant (e.g., +1,-1 for northeast). Each option teleports to the port and sets a global variable. Excludes port26 and the current location. Adjusts dialog window size based on number of options.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to populate with port teleport options"
        },
        {
          "name": "floats[0]",
          "description": "The X direction filter for port selection: -1 for west, 0 for center, +1 for east relative to overworld center"
        },
        {
          "name": "floats[1]",
          "description": "The Y direction filter for port selection: -1 for north, 0 for center, +1 for south relative to overworld center"
        }
      ],
      "optional": []
    },
    {
      "name": "bighead",
      "description": "Toggles big head mode on and off, making character heads appear larger. If no bool parameter is provided, toggles the current state. If bools[0] is true, forces big head mode to be enabled.",
      "required": [],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If true, forces big head mode to be enabled. If not provided, toggles the current bigHeadMode state"
        }
      ]
    },
    {
      "name": "b",
      "description": "Switches the game mode to build mode, allowing the player to place structures and build. Short alias for the 'build' task.",
      "required": [],
      "optional": []
    },
    {
      "name": "boardActor",
      "description": "Initiates boarding of another actor's zone or ship. Moves the player to a boarding zone associated with the target actor. Sets a brief interaction delay to prevent immediate re-interaction.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor/ship to board"
        },
        {
          "name": "strings[1]",
          "description": "Additional boarding parameter (likely the zone or specific boarding location identifier)"
        }
      ],
      "optional": []
    },
    {
      "name": "build",
      "description": "Switches the game mode to build mode, allowing the player to place structures and build.",
      "required": [],
      "optional": []
    },
    {
      "name": "buryAllItemsOfType",
      "description": "Buries or unburies all items of a specific type or with a specific special property across the entire zone. Iterates through every tile in the zone, finding matching items and setting their buried status. Can match by item ID or by special property. The bool parameter controls whether to bury (false) or unbury (true).",
      "required": [
        {
          "name": "strings[0]",
          "description": "The item type ID to bury/unbury. Items with this exact ID will be affected"
        },
        {
          "name": "bools[0]",
          "description": "If false, buries the items (makes them hidden). If true, unburies them (makes them visible)"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "A special property name to filter items by. If provided and non-empty, also affects all items with this special property regardless of their item ID"
        }
      ]
    },
    {
      "name": "buryGlobalVarItems",
      "description": "Manages visibility of items that have the 'setGlobalVarWhenConverted' special property based on corresponding global variables. Iterates through all items in the zone, and for matching items, unburies them if their global variable (named after their item ID) is greater than 0, otherwise buries them. Used for quest or progression-based item visibility.",
      "required": [],
      "optional": []
    },
    {
      "name": "buryLocations",
      "description": "Buries all location marker items for undiscovered locations in the current zone. Searches the zone's locations dictionary and for each undiscovered location, finds all items with the 'location' special property at and around that location's coordinates (center plus/minus one tile in each cardinal direction) and buries them. Only works if the current zone has locations in the game state.",
      "required": [],
      "optional": []
    },
    {
      "name": "buyFood_fillCargo",
      "description": "Purchases food to completely fill the remaining cargo space. Calculates how much cargo space is available, determines the cost to fill that space with food, and if the player has enough money, completes the purchase and adds the food to cargo inventory.",
      "required": [],
      "optional": []
    },
    {
      "name": "buyFood",
      "description": "Purchases a specific quantity of food using the item's base value for pricing. Deducts the cost from player money and adds the food to cargo inventory. Only completes the purchase if the player has enough money.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The quantity of food to purchase. Uses the last float in the array (floats.Count - 1), so this should be the only or last float provided"
        }
      ],
      "optional": []
    },
    {
      "name": "buyGoods_confirmWindow",
      "description": "Opens a confirmation window with a slider for purchasing trade goods from the current location. Uses the location's trade good item type. Sets a default quantity of 1 if the provided quantity is 0. Opens the buy slider UI for the goods.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The initial/default quantity for the purchase slider. Uses the last float in the array. If 0, automatically sets to 1"
        }
      ],
      "optional": []
    },
    {
      "name": "buyGoods",
      "description": "Purchases trade goods from the current location. Calculates the cost based on the trade good's value multiplied by the quantity, deducts money from the player, and adds the purchased goods to the cargo inventory. Only completes if the player has enough money to afford the purchase.",
      "required": [
        {
          "name": "floats[floats.Count - 1]",
          "description": "Quantity of trade goods to purchase (uses last float in array)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Optional tile coordinate (stored but not used in this task)"
        }
      ]
    },
    {
      "name": "buyItem_confirmWindow",
      "description": "Opens a confirmation window for purchasing an item with a quantity slider. If the item has the cargo property, opens the cargo window, otherwise opens the stash window. Defaults to quantity of 1 if floats[floats.Count - 1] is 0.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item type ID to purchase"
        },
        {
          "name": "floats[floats.Count - 1]",
          "description": "Initial quantity to display in the slider (defaults to 1 if set to 0)"
        }
      ],
      "optional": []
    },
    {
      "name": "buyLocationFood",
      "description": "Purchases food from the current location's cafe for the entire crew. Deducts money based on the buy price multiplied by crew size, increases crew morale by the food's power value, applies any actor value effects from the food to boats or crew members, saves the food ID to the 'lastFoodEaten' global variable, teleports the party to travel point (0,2), and clears the party's path.",
      "required": [],
      "optional": []
    },
    {
      "name": "buyShip",
      "description": "Purchases a ship of the specified actor type. Deducts the ship's value from player money, increments the 'shipsBought' global variable, clones the actor prefab with a unique ID, sets it to non-hostile player faction, adds it to the player's fleet (creating a new fleet if none exists), and plays a success sound.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor type ID of the ship to purchase"
        }
      ],
      "optional": []
    },
    {
      "name": "bz",
      "description": "Debug command that lists all zone data files in the Content/Data/ZoneData/ directory that start with 'bz'. The file names are concatenated into a string, wrapped for display, and drawn as debug text on screen.",
      "required": [],
      "optional": []
    },
    {
      "name": "calc",
      "description": "Debug command that evaluates a formula string and displays the result on screen. Creates a new Formula from the provided string, calculates it using the player actor, and displays the result as debug text with the formula string as the label.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Formula string to evaluate (only used if strings.Count >= 1)"
        }
      ]
    },
    {
      "name": "cameraAtPlayer",
      "description": "Points the camera at the player character's current tile coordinate position.",
      "required": [],
      "optional": []
    },
    {
      "name": "cameraAtPoint",
      "description": "Points the camera at a specific travel point and sets it to fixed camera mode. The travel point is determined by converting the two float indices into a travel point coordinate.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Travel point number (first index)"
        },
        {
          "name": "floats[1]",
          "description": "Travel point set number (second index)"
        }
      ],
      "optional": []
    },
    {
      "name": "cameraAtPointLock",
      "description": "Points the camera at a specific travel point, sets it to fixed camera mode, and locks the camera so it cannot be changed by setting the cameraCantBeChangedTimer to an extremely high value (999999). The travel point is determined by converting the two float indices into a travel point coordinate.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Travel point number (first index)"
        },
        {
          "name": "floats[1]",
          "description": "Travel point set number (second index)"
        }
      ],
      "optional": []
    },
    {
      "name": "cameraAtTalker",
      "description": "Points the camera at the current talker actor's tile coordinate position. The talker is identified by the actorID property of the task.",
      "required": [],
      "optional": []
    },
    {
      "name": "cancelIfEnemiesNotPresent",
      "description": "Cancels the task chain if no hostile enemies are present within a specified distance. Checks all actors in the zone and actors to be added. If floats[0] is 0, any enemy anywhere triggers presence. Otherwise checks distance from the reference point (talker position or tileCoords[0]). Returns false (cancels) if no enemies are found within range.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Distance in tiles to search for enemies (0 means check entire zone)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Reference point for distance checks (uses talker position if not provided)"
        }
      ]
    },
    {
      "name": "cancelIfEnemiesPresent",
      "description": "Cancels the task chain if any hostile enemies are present within a specified distance. Checks all actors in the zone and actors to be added. If floats[0] is 0, any enemy anywhere triggers cancellation. Otherwise checks distance from the reference point (talker position or tileCoords[0]). Can optionally filter by specific actor type ID. Returns false (cancels) if matching enemies are found within range.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Distance in tiles to search for enemies (0 means check entire zone)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Specific actor type ID to search for (empty string means any hostile actor)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Reference point for distance checks (uses talker position if not provided)"
        }
      ]
    },
    {
      "name": "cancelIfItemNotPresent",
      "description": "Cancels the task chain if a specific item type is not present at the specified location. If tileCoords[0] is provided, checks only that tile. Otherwise searches the entire area defined by topLeftTC and btmRightTC. Returns false (cancels) if the item is not found at the specified location.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item type ID to search for"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to check (if not provided, searches the trigger area)"
        }
      ]
    },
    {
      "name": "cancelIfItemPresent",
      "description": "Cancels the task chain if a specific item type is present at the specified location. If tileCoords[0] is provided, checks only that tile. Otherwise searches the entire area defined by topLeftTC and btmRightTC. Returns false (cancels) if the item is found at any searched location.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item type ID to search for"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to check (if not provided, searches the trigger area)"
        }
      ]
    },
    {
      "name": "cancelIf",
      "description": "Cancels the current task chain if a formula condition is met. Evaluates the formula using the actor and optional parameters. If the result is <= 0 (false), the task continues normally. If the result is > 0 (true), the task chain is cancelled (returns false). The bool can invert the logic so cancellation occurs when the result is >= 1.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Formula string to evaluate as the condition"
        },
        {
          "name": "floats[0]",
          "description": "Modifier value passed to the formula calculation"
        },
        {
          "name": "bools[0]",
          "description": "If true, inverts the logic to cancel when result >= 1 instead of > 0"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Optional tile coordinate to pass to the formula calculation"
        }
      ]
    },
    {
      "name": "cancelQuest",
      "description": "Cancels the current quest by clearing all quest-related global variables (questType, questGiver, questReward, questDest, questLog, questGoal, questRoyal, questStartNum, questCompleted, questLogImage). Also hides all monster den locations in the 'eral' region by setting them to non-discoverable and undiscovered.",
      "required": [],
      "optional": []
    },
    {
      "name": "cancelRoyalQuest",
      "description": "Cancels the current quest only if it is a royal quest (questRoyal > 0). Clears all quest-related global variables (questType, questGiver, questReward, questDest, questLog, questGoal, questRoyal, questStartNum, questCompleted, questLogImage). Also hides all monster den locations in the 'eral' region by setting them to non-discoverable and undiscovered.",
      "required": [],
      "optional": []
    },
    {
      "name": "captureShipNum",
      "description": "Captures a specific enemy or assist fleet ship by index and adds it to the player's fleet. Only works if player has fewer than 9 boats. The ship is set to non-hostile player faction, crew is cleared, cloth palette changes to 'p26', max HP is reduced by 2, the ship is renamed with a 'cap' suffix, and the 'shipsCaptured' global variable is incremented. The fleet window is refreshed to show the new addition.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Index of the ship to capture from the combined list of non-incapacitated enemy/assist fleet ships"
        }
      ],
      "optional": []
    },
    {
      "name": "captureShips_afterCombat",
      "description": "Creates a dynamic dialog node that allows the player to select which enemy/assist ships to capture after combat. Clears the specified dialog node and populates it with options for each non-incapacitated, crewed ship. Each ship gets two options: one to capture it (triggers captureShipNum task) and one to view its stats. Opens the fleet window if ships are available, displays 'Done' option to proceed to loot.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to populate with ship capture options"
        }
      ],
      "optional": []
    },
    {
      "name": "cartographer_report",
      "description": "Generates a cartographer's report based on world map exploration progress. Calculates the percentage of the 'eral' world map that has been explored, compares it to the last paid percentage (mapPercentPaid), and generates payment based on new exploration. Exploration under 30% pays 100 per %, 30%+ pays 250 per %. At 100% completion, grants a 25000 bonus, 1000 explore fame, reveals the entire map, and changes the talker's dialog node. Updates the specified dialog node with appropriate statements and money/fame rewards.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to update with the cartographer's report and rewards"
        }
      ],
      "optional": []
    },
    {
      "name": "cfog",
      "description": "Clears the fog of war for the entire current zone. Marks all tiles in the zone as known in the fog of war system. If the current zone is 'eral', also discovers all discoverable locations in that zone. Refreshes the minimap with a full update to reflect the changes.",
      "required": [],
      "optional": []
    },
    {
      "name": "changeCafeFood",
      "description": "Changes the cafe food available at the current location. If strings[0] is a location ID, copies that location's cafe food and auto-spawn data to the current location. If strings[0] is an item type ID (not a valid location), sets the current location's cafe food directly to that item type ID.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Either a location ID to copy cafe food from, or an item type ID to set directly"
        }
      ],
      "optional": []
    },
    {
      "name": "changeFaction",
      "description": "Changes all actors belonging to one faction to a new faction. Calls ZoneManager's changeFaction method with the old faction name and new faction name.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Current faction name to change from"
        },
        {
          "name": "strings[1]",
          "description": "New faction name to change to"
        }
      ],
      "optional": []
    },
    {
      "name": "changePlayerActor",
      "description": "Changes the current player-controlled actor to a different party member. Calls InputManager's changePlayerActor with the specified actor ID and all reordering/effects disabled (pushCurrentActorToBack=false, bringSubsequentActorsToFront=false, pushLeadingActorsToBack=false, playFX=false).",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID of the party member to switch control to"
        }
      ],
      "optional": []
    },
    {
      "name": "changeScreenResolution2",
      "description": "Triggers a screen resolution change using the game's changeScreenResolution2 method. This is a utility task that calls the resolution change function without any parameters.",
      "required": [],
      "optional": []
    },
    {
      "name": "changeZoneDarkColor",
      "description": "Sets the zone's darkness state to true and changes the darkness color overlay. Converts the color string to a Color using Data.getColor. If bools[0] is true, also immediately applies the darkness color to the camera's darknessColor property for instant visual effect.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Color string to use for zone darkness (parsed by Data.getColor)"
        },
        {
          "name": "bools[0]",
          "description": "If true, immediately applies the darkness color to the camera as well"
        }
      ],
      "optional": []
    },
    {
      "name": "cleanUpQuest",
      "description": "Cleans up quest state by clearing all quest-related global variables (questType, questGiver, questReward, questDest, questLog, questGoal, questRoyal, questStartNum, questCompleted, questLogImage). Also hides all monster den locations in the 'eral' region by setting them to non-discoverable and undiscovered. Identical to cancelQuest.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearDialogNode",
      "description": "Clears the dialog node ID for the current talker actor. Sets the actor's dialogNodeID property to an empty string, effectively removing any assigned dialog from that actor.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearfog",
      "description": "Clears the fog of war for the entire current zone. Marks all tiles in the zone as known in the fog of war system. If the current zone is 'eral', also discovers all discoverable locations in that zone. Refreshes the minimap with a full update to reflect the changes. Alias for cfog.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearGlobalVar",
      "description": "Clears a global variable by name. Removes the variable from the global variable storage completely, rather than just setting it to zero.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Name of the global variable to clear"
        }
      ],
      "optional": []
    },
    {
      "name": "clearitems",
      "description": "Removes items from all tiles in the entire zone. If strings[0] is provided, only removes items of that specific item type ID. Otherwise removes all items from every tile. Iterates through the entire zone grid from (0,0) to (sizeX, sizeY).",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Specific item type ID to remove (if not provided, removes all items)"
        }
      ]
    },
    {
      "name": "clearj",
      "description": "Clears all known journal entries and resets them to defaults. Clears the knownJournalEntries list and then re-adds all default journal entries from Data.defaultKnownJournalEntries without showing alerts. Effectively resets the journal to its initial state.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearjournal",
      "description": "Clears all known journal entries and resets them to defaults. Clears the knownJournalEntries list and then re-adds all default journal entries from Data.defaultKnownJournalEntries without showing alerts. Effectively resets the journal to its initial state. Alias for clearj.",
      "required": [],
      "optional": []
    },
    {
      "name": "clear",
      "description": "Clears all debug drawing queues. Clears the indefinite debug draw queue, the draw queue that ignores darkness, and all debug draw strings. Useful for cleaning up debug visualizations.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearroof",
      "description": "Removes all roof items from the entire zone. Iterates through every tile in the zone grid and removes items with the 'roof' special property. This is useful for making indoor areas visible or removing overhead obstructions.",
      "required": [],
      "optional": []
    },
    {
      "name": "clearroofs",
      "description": "Removes all roof items from the entire zone. Iterates through every tile in the zone grid and removes items with the 'roof' special property. This is useful for making indoor areas visible or removing overhead obstructions. Alias for clearroof.",
      "required": [],
      "optional": []
    },
    {
      "name": "closeCharEdit",
      "description": "Closes the character editor window. Triggers the 'closeCharEdit' UI input action to dismiss the character customization interface.",
      "required": [],
      "optional": []
    },
    {
      "name": "closeFleetWindow",
      "description": "Closes the fleet management window. Calls InputManager's close_fleetWindow method to dismiss the fleet interface.",
      "required": [],
      "optional": []
    },
    {
      "name": "closeJournal",
      "description": "Closes the journal window. Refreshes the journal contents and then sets the journal window's visible property to false to hide it from view.",
      "required": [],
      "optional": []
    },
    {
      "name": "completeJournalGoal",
      "description": "Marks a journal goal as completed with visual and audio feedback. Concatenates all strings into a goal identifier, searches for matching goal in global variables (goal0-goal19), marks it as done with 'longLine', opens the journal with both entries visible, plays completion effects (wide flash and sounds), and optionally awards 50 XP to all crew (unless bools[0] is true to skip XP).",
      "required": [
        {
          "name": "strings[0]",
          "description": "Primary goal identifier (additional strings are concatenated with commas)"
        }
      ],
      "optional": [
        {
          "name": "strings[1+]",
          "description": "Additional goal identifier parts (concatenated with commas if not empty)"
        },
        {
          "name": "bools[0]",
          "description": "If true, skips the crew XP reward and disables cursor on journal"
        }
      ]
    },
    {
      "name": "consolecommand",
      "description": "Executes a console command from within a task. Passes the command string to InputManager's handleConsoleCommand method for processing, then clears any debug draw strings. This allows tasks to trigger developer/debug commands programmatically.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Console command string to execute"
        }
      ],
      "optional": []
    },
    {
      "name": "convertPlayerPortsToFaction",
      "description": "Converts all player-owned ports (locations with 'sport' tag) in the 'eral' region to a specified faction. Calls setEverloyal on each sport location to change its faction allegiance permanently.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Faction name to convert all player ports to"
        }
      ],
      "optional": []
    },
    {
      "name": "convertRGB",
      "description": "Developer utility that converts an image file to the game's RGB palette scheme. Loads a PNG file from the desktop by name, converts it to the RGB palette scheme, and saves the result back to the desktop with '_rgb' suffix. Used for preparing art assets for the game's color system.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Filename (without .png extension) of the image on the desktop to convert"
        }
      ]
    },
    {
      "name": "crash",
      "description": "Intentionally crashes the game for testing purposes. Creates an empty dictionary and attempts to access a non-existent key ('nnotreal'), causing a KeyNotFoundException that will crash the application. This is a debug/testing task.",
      "required": [],
      "optional": []
    },
    {
      "name": "createMonsterDenNearby",
      "description": "Creates a new monster den location near the current location. Finds the nearest existing monster den location (within range 0-9999, excluding current location), creates a new monster den at that position using the specified level data, makes it discoverable, and adds it to the 'eral' locations dictionary.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Level data ID to use for the new monster den"
        }
      ],
      "optional": []
    },
    {
      "name": "createTreasureMap",
      "description": "Creates a treasure map image centered on specific coordinates. Loads the 'eral' special zone, removes hazards and loot items, takes a 32x32 tile screenshot at 2x scale centered on the coordinates, converts it to RGB palette, applies sepia tone (p62 with 0.25 opacity), adds an X mark at the center, crops to 240x132, combines with treasure map frame, saves to current save folder, and stores the coordinates in treasureTCX/treasureTCY global variables.",
      "required": [
        {
          "name": "floats[0]",
          "description": "X coordinate of the treasure location"
        },
        {
          "name": "floats[1]",
          "description": "Y coordinate of the treasure location"
        }
      ],
      "optional": []
    },
    {
      "name": "createZoneSpecialFX",
      "description": "Creates zone-wide special effects (like water or overlay effects) by dividing the zone into 1024x1024 pixel tiles. For each tile, generates a special FX texture, creates particle and FX data entries with appropriate settings, and adds them to the zone. If bools[0] is true, creates water FX (below everything, alpha modified, wraps around edges). Otherwise creates overlay FX (above everything). Can optionally save textures to desktop and set custom alpha with floats[0].",
      "required": [
        {
          "name": "strings[0]",
          "description": "String parameter passed to generateSpecialFXTexture for FX generation"
        },
        {
          "name": "bools[0]",
          "description": "If true, creates water FX (depth -999999, wraps edges). If false, creates overlay FX (depth +99999)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Velocity offset for FX scrolling (X*0.1, Y*0.1), enables edge wrapping and roof-conditional drawing"
        },
        {
          "name": "floats[0]",
          "description": "Custom alpha offset for the FX (if not 0)"
        },
        {
          "name": "bools[1]",
          "description": "If true, saves generated textures to desktop for debugging"
        }
      ]
    },
    {
      "name": "crewMorale",
      "description": "Modifies the crew morale value by the specified amount. Calls Game1.currentGameState.modCrewMorale with the provided modifier, which can be positive (increase morale) or negative (decrease morale).",
      "required": [
        {
          "name": "floats[0]",
          "description": "Amount to modify crew morale (positive to increase, negative to decrease)"
        }
      ],
      "optional": []
    },
    {
      "name": "crewxp",
      "description": "Awards experience points to all crew members. Calls ZoneManager's allCrew_awardXP method with the specified XP amount, distributing it to all crew members in the player's fleet.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Amount of experience points to award to all crew members"
        }
      ],
      "optional": []
    },
    {
      "name": "csave",
      "description": "Creates a manual save file with a custom name. Saves the current game state to a non-system save file using DataManager.saveGame. Defaults to 'consoleSave' if no name is provided, otherwise uses the specified save name.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Custom save file name (defaults to 'consoleSave' if not provided)"
        }
      ]
    },
    {
      "name": "cutsceneMode",
      "description": "Enables or disables cutscene mode, which affects camera behavior and UI interaction. When enabled, it also disables the speed-up enemy turn toggle. If no bool parameter is provided, cutscene mode is enabled by default.",
      "required": [],
      "optional": [
        {
          "name": "bools[0]",
          "description": "Whether to enable (true) or disable (false) cutscene mode. If not provided, defaults to enabling cutscene mode."
        }
      ]
    },
    {
      "name": "damageNumber",
      "description": "Displays a floating damage number (text popup) at the player's position with custom text and duration. The text will move upward and fade out over time.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The text to display in the damage number popup"
        },
        {
          "name": "floats[0]",
          "description": "Additional duration in seconds added to the base 2-second display time. Total display time will be 2 + floats[0] seconds."
        }
      ],
      "optional": []
    },
    {
      "name": "damageNumber_worldTime",
      "description": "Displays a floating damage number (text popup) at the player's position showing the current in-game time in hour:minute format. The text will move upward and fade out over time.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Additional duration in seconds added to the base 2-second display time. Total display time will be 2 + floats[0] seconds."
        }
      ],
      "optional": []
    },
    {
      "name": "debug_drawStrings",
      "description": "Draws a debug message with a custom label and value, visible in debug mode. Only displays if both strings are provided and the first string is not empty.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The label/category for the debug message"
        },
        {
          "name": "strings[1]",
          "description": "The value/content to display for this debug message"
        }
      ]
    },
    {
      "name": "debug",
      "description": "Toggles debug mode on or off and displays the current debug mode state with a debug message.",
      "required": [],
      "optional": []
    },
    {
      "name": "debugMessage",
      "description": "Displays a debug message with either a custom label and value, or with the default 'Debug' label if only one string is provided.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The debug message value to display (or label if strings[1] is provided)"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "If provided, strings[0] becomes the label and this becomes the value to display"
        }
      ]
    },
    {
      "name": "delayActions",
      "description": "Delays the next action in the zone by the specified duration. If a longer delay is already active, it will use the maximum of the two delays.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The delay duration in seconds before the next action can execute"
        }
      ],
      "optional": []
    },
    {
      "name": "delayDialog",
      "description": "Temporarily hides the dialog window for a specified duration, prevents player interaction during that time, then resumes the dialog automatically after the timer expires.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The duration in seconds to hide the dialog and prevent interaction before resuming"
        }
      ],
      "optional": []
    },
    {
      "name": "deleteZone",
      "description": "Permanently deletes zone data for the specified zone ID. This is a destructive operation that only works when in console mode, providing a safety check against accidental deletion.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the zone to permanently delete"
        }
      ],
      "optional": []
    },
    {
      "name": "destination",
      "description": "Sets an actor's destination to the specified tile coordinates, clearing their current path and AI target. Optionally sets the actor's movement speed. Uses the task's actor if no actor ID is provided or if the specified actor doesn't exist.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The destination tile coordinates (X and Y) where the actor should move to"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to set the destination for. If empty or actor not found, uses the task's actorID."
        },
        {
          "name": "floats[0]",
          "description": "The movement speed to set for the actor. Only applied if the value is greater than 0."
        }
      ]
    },
    {
      "name": "dialogEffect",
      "description": "Schedules a special dialog effect to execute after a specified delay using a timer. The effect is identified by name and can accept an optional parameter.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name/ID of the dialog effect to execute"
        },
        {
          "name": "floats[1]",
          "description": "The delay in seconds before the dialog effect executes"
        }
      ],
      "optional": []
    },
    {
      "name": "die",
      "description": "Forces the task's actor to die by making them killable and dealing massive damage. This will kill the actor regardless of their current unkillable status.",
      "required": [],
      "optional": []
    },
    {
      "name": "disableFog",
      "description": "Disables fog of war rendering for the current zone, making all areas visible regardless of exploration status.",
      "required": [],
      "optional": []
    },
    {
      "name": "disableHelpGem",
      "description": "Disables the help gem feature and sets its usability timer to -1, preventing it from becoming available again until manually re-enabled.",
      "required": [],
      "optional": []
    },
    {
      "name": "disableTrigger",
      "description": "Disables a trigger in the current zone by marking it as done, preventing it from firing again. The trigger can be identified by either its numeric ID or its string name.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The numeric ID of the trigger to disable. This is used if strings[0] is empty or doesn't match a trigger name."
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The string name/ID of the trigger to disable. If provided and a matching trigger exists, its numeric ID will be used instead of floats[0]."
        }
      ]
    },
    {
      "name": "disableUI",
      "description": "Hides all UI elements including quickslots, character stats, and small tab windows. Sets the hidden UI flag in the game state.",
      "required": [],
      "optional": []
    },
    {
      "name": "discoverFog",
      "description": "Reveals fog of war at the specified tile coordinates by calling the discover function four times for that position, ensuring the area is fully revealed.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinates where fog of war should be discovered/revealed"
        }
      ],
      "optional": []
    },
    {
      "name": "dm",
      "description": "Toggles debug mode on or off and displays the current debug mode state with a debug message. This is an alias for the 'debug' task.",
      "required": [],
      "optional": []
    },
    {
      "name": "dominateworld",
      "description": "Makes all port locations in the 'eral' region extremely wealthy (wealth level 100) and loyal to the player's faction if the playerFaction global variable is set. This effectively gives the player economic control of the world.",
      "required": [],
      "optional": []
    },
    {
      "name": "donate",
      "description": "Donates money at the current location, increasing favor with that location's faction and trade fame while decreasing piracy fame. If the location has no faction, only fame is affected with doubled piracy reduction. The amount is multiplied by 0.001 for favor/fame calculations.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount of money to donate. This value is multiplied by 0.001 to calculate favor and fame changes."
        }
      ],
      "optional": []
    },
    {
      "name": "dropItem",
      "description": "Removes items from a specified actor's inventory and drops them on the ground at that actor's position. If no quantity is specified, defaults to dropping 1 item.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor whose inventory contains the item to drop"
        },
        {
          "name": "strings[1]",
          "description": "The ID of the item type to remove and drop"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The quantity of items to drop. Defaults to 1 if set to 0 or not provided."
        }
      ]
    },
    {
      "name": "editmod",
      "description": "Uploads an updated version of a Steam Workshop mod by updating its content and preview image. The mod must pass validation and uses the most recently created mod ID. Shows an uploading dialog that prevents player interaction until complete.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The folder name of the mod to update/edit in the mod data directory"
        }
      ],
      "optional": []
    },
    {
      "name": "editmodtags",
      "description": "Updates only the tags for an existing Steam Workshop mod without changing its content. All provided strings are concatenated and parsed as tags. Shows an uploading dialog that prevents player interaction until complete.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The first part of the tag string. If this is the only string provided, it should contain the mod folder name followed by tag data."
        }
      ],
      "optional": [
        {
          "name": "strings[1+]",
          "description": "Additional strings that are concatenated with strings[0] to form the complete tag data"
        }
      ]
    },
    {
      "name": "enableHelpGem",
      "description": "Enables the help gem feature, allowing players to access help/hint functionality.",
      "required": [],
      "optional": []
    },
    {
      "name": "enableTrigger",
      "description": "Re-enables a previously disabled trigger in the current zone by removing it from the list of completed triggers, allowing it to fire again. The trigger can be identified by either its numeric ID or its string name.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The numeric ID of the trigger to enable. This is used if strings[0] is empty or doesn't match a trigger name."
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The string name/ID of the trigger to enable. If provided and a matching trigger exists, its numeric ID will be used instead of floats[0]."
        }
      ]
    },
    {
      "name": "enableUI",
      "description": "Shows all UI elements including quickslots and character stats. Clears the hidden UI flag in the game state.",
      "required": [],
      "optional": []
    },
    {
      "name": "endBoarding",
      "description": "Returns the player from a boarding combat zone back to the previous zone. Optionally specifies which zone to return to.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The zone ID to return to. If not provided, returns to the default previous zone."
        }
      ]
    },
    {
      "name": "endGame",
      "description": "Ends the current game and returns to the main menu. If extras were unlocked during this session, shows the unlock extras screen after a 1-second delay.",
      "required": [],
      "optional": []
    },
    {
      "name": "enemyFlee",
      "description": "Makes all actors in the task actor's faction flee from combat within an 18-tile radius. Plays flee visual effects and sound, removes the fleeing actors, and awards XP to all party members based on the combat group's power level (approximately 94.5% of the group's total power level).",
      "required": [],
      "optional": []
    },
    {
      "name": "enemyInitiateCombat",
      "description": "Forces the task's actor to initiate combat with the player. Changes the game mode to travel, makes both actors play idle animations, then starts combat between them. Clears the task's actorID after execution.",
      "required": [],
      "optional": []
    },
    {
      "name": "enemyMoraleDown",
      "description": "Decreases morale by 1 for all actors in the task actor's faction within an 18-tile radius. The morale effect lasts for 65 seconds.",
      "required": [],
      "optional": []
    },
    {
      "name": "enemyMoraleUp",
      "description": "Increases morale by 1 for all actors in the task actor's faction within an 18-tile radius. The morale effect lasts for 65 seconds.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterBuyMode_fleet",
      "description": "Opens the buy/trade interface showing the task actor's fleet cargo as the merchant's goods, with the player's cargo as the buying inventory. Enables trade mode and sets up UI for purchasing cargo items from a fleet.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterBuyMode",
      "description": "Opens the buy/trade interface showing the task actor's inventory (or their priority container if they have one) as the merchant's goods, with the player's stash as the buying inventory. Enables trade mode and sets up UI for purchasing items.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterBuyMode_locationItems",
      "description": "Opens the buy/trade interface showing the current location's stash items as the merchant's goods, with the player's stash as the buying inventory. Only works when at a location; shows an error if not currently in a location. Enables trade mode and sets up UI for purchasing location items.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterBuyMode_location",
      "description": "Opens the buy/trade interface showing the current location's cargo as the merchant's goods, with the player's cargo as the buying inventory. Only works when at a location; shows an error if not currently in a location. Enables trade mode and sets up UI for purchasing location cargo.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterCombat",
      "description": "Initiates combat mode centered at the specified tile coordinates. The battlefield radius and initiating actor can be customized, or defaults to an 18-tile radius with no specific initiator.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinates (X and Y) to center the combat area on"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The battlefield radius in tiles. If 0 or not provided, defaults to 18 tiles."
        },
        {
          "name": "strings[0]",
          "description": "The ID of the actor initiating combat. If not provided, combat starts with no specific initiator."
        }
      ]
    },
    {
      "name": "enterCombat_timer",
      "description": "Immediately enters combat mode at the specified coordinates with a large 999-tile radius, then schedules an action to execute after a delay using an act timer. Useful for timed combat events.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinates (X and Y) to center the combat area on and where the timed action will execute"
        },
        {
          "name": "strings[0]",
          "description": "The ID of the action to execute when the timer expires"
        },
        {
          "name": "floats[0]",
          "description": "The delay in seconds before the action executes"
        }
      ],
      "optional": []
    },
    {
      "name": "enterFleetBattle",
      "description": "Initiates a fleet battle between two actors/fleets. If two actor IDs are provided, uses those; otherwise finds the nearest hostile actor within 2 tiles of the task actor's flagship to battle against. This variant does not force the player's fleet to participate.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the first fleet's actor to participate in the battle"
        },
        {
          "name": "strings[1]",
          "description": "The ID of the second fleet's actor to battle against. Required if strings[0] is provided."
        }
      ]
    },
    {
      "name": "enterFleetBattle_player",
      "description": "Initiates a fleet battle between two actors/fleets with the player forced to participate. If two actor IDs are provided, uses those; otherwise finds the nearest hostile actor within 2 tiles of the task actor's flagship to battle against. This variant forces the player's fleet into the battle.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the first fleet's actor to participate in the battle"
        },
        {
          "name": "strings[1]",
          "description": "The ID of the second fleet's actor to battle against. Required if strings[0] is provided."
        }
      ]
    },
    {
      "name": "enterLocation",
      "description": "Enters the nearest location (port or non-port) to the player's current position in the current zone, within a 4-tile search radius.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterPort",
      "description": "Enters the nearest port location to the player's current position in the current zone, within a 4-tile search radius. Only searches for ports, not other location types.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterSellMode_cargo",
      "description": "Enables trade mode and opens the cargo inventory UI for selling cargo items.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterSellMode",
      "description": "Enables trade mode and opens all party member inventories in a list formation for selling items.",
      "required": [],
      "optional": []
    },
    {
      "name": "enterSellMode_stash",
      "description": "Enables trade mode and opens the stash inventory UI for selling stash items.",
      "required": [],
      "optional": []
    },
    {
      "name": "errors",
      "description": "Toggles error message display on or off and shows the current error message state with a debug message.",
      "required": [],
      "optional": []
    },
    {
      "name": "escapeGate",
      "description": "Makes the task's actor perform an escape gate action (teleport away). If in combat mode and the actor is hostile, awards their XP value to the party before they escape. Adds a 1-second delay to the next action.",
      "required": [],
      "optional": []
    },
    {
      "name": "executeDialogEffect",
      "description": "Executes a special dialog effect immediately with the specified effect name, actor ID, parameter string, and float value. This directly calls the dialog effect system.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name/ID of the dialog effect to execute"
        },
        {
          "name": "strings[1]",
          "description": "A parameter string passed to the dialog effect"
        },
        {
          "name": "floats[0]",
          "description": "A float value parameter passed to the dialog effect"
        }
      ],
      "optional": []
    },
    {
      "name": "exitCombat",
      "description": "Forces an exit from combat mode if currently in combat. Can optionally award XP based on the bool parameter. The exit is forced regardless of normal combat end conditions.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to skip awarding XP on combat exit. If true, no XP is awarded; if false, XP is awarded normally."
        }
      ],
      "optional": []
    },
    {
      "name": "exitDialog",
      "description": "Exits dialog mode and returns to travel mode if currently in a dialog. Does nothing if not currently in dialog mode.",
      "required": [],
      "optional": []
    },
    {
      "name": "facingRot0",
      "description": "Sets the facing rotation of the task's actor to 0 degrees (facing right). The rotation is applied immediately and also triggers a visual effect update via the timer system.",
      "required": [],
      "optional": []
    },
    {
      "name": "facingRot180",
      "description": "Sets the facing rotation of the task's actor to 180 degrees (facing left). The rotation is applied immediately and also triggers a visual effect update via the timer system.",
      "required": [],
      "optional": []
    },
    {
      "name": "facingRot270",
      "description": "Sets the facing rotation of the task's actor to 270 degrees (facing up). The rotation is applied immediately and also triggers a visual effect update via the timer system.",
      "required": [],
      "optional": []
    },
    {
      "name": "facingRot90",
      "description": "Sets the facing rotation of the task's actor to 90 degrees (facing down). The rotation is applied immediately and also triggers a visual effect update via the timer system.",
      "required": [],
      "optional": []
    },
    {
      "name": "facingRot",
      "description": "Sets the facing rotation of an actor to a specified angle in degrees. If no actor ID is provided, the task's actor is used. The rotation can be set to any custom value.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The rotation angle in degrees to set the actor's facing direction (0=right, 90=down, 180=left, 270=up)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor whose facing rotation should be changed. If empty or not provided, uses the task's actorID"
        }
      ]
    },
    {
      "name": "facingRotParty",
      "description": "Sets the facing rotation of all party members to the same specified angle in degrees. This affects every actor currently in the player's party.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The rotation angle in degrees to set for all party members (0=right, 90=down, 180=left, 270=up)"
        }
      ],
      "optional": []
    },
    {
      "name": "facingRotPrev",
      "description": "Restores the actor's facing rotation to the previous value stored in the input manager. This is useful for returning an NPC to their original facing direction after a conversation.",
      "required": [],
      "optional": []
    },
    {
      "name": "fillj",
      "description": "Unlocks all journal entries in the game by adding every entry from the data registry to the player's known journal entries. After adding all entries, the journal is sorted by category. This is a debug/cheat command.",
      "required": [],
      "optional": []
    },
    {
      "name": "filljournal",
      "description": "Unlocks all journal entries in the game by adding every entry from the data registry to the player's known journal entries. After adding all entries, the journal is sorted by category. This is a debug/cheat command.",
      "required": [],
      "optional": []
    },
    {
      "name": "flee",
      "description": "Makes the task's actor flee from combat, removing them from the battle and awarding the party 90% of the actor's XP value. A flee sound effect plays, the actor is removed from the zone, and a confirmation message is displayed. The default flee visual effect can be overridden.",
      "required": [],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The visual effect ID to play when the actor flees. Defaults to 'actor_flee' if not provided"
        }
      ]
    },
    {
      "name": "fl",
      "description": "Toggles the FPS limit for the game. This is a debug command that allows unlimited frame rate or restores the frame rate cap.",
      "required": [],
      "optional": []
    },
    {
      "name": "fog",
      "description": "Resets the fog of war for the entire current zone, marking all tiles as unknown. This forces the player to re-explore the area to reveal the map again.",
      "required": [],
      "optional": []
    },
    {
      "name": "forget",
      "description": "Deletes saved zone data for a specified zone, effectively resetting that zone to its initial state. This removes all trigger flags and resets all state for that zone. When used in console mode, it displays debug messages confirming the action or indicating if the zone doesn't exist.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the zone whose saved data should be deleted and reset"
        }
      ]
    },
    {
      "name": "formulas",
      "description": "Displays all global formulas defined in the game data by printing each formula's key and formula string to the debug output. This is a debug command for inspecting formula definitions.",
      "required": [],
      "optional": []
    },
    {
      "name": "fullheal",
      "description": "Fully heals the entire party, restoring all HP and MP and removing negative status effects. This is a convenience command for quickly restoring the party to full health.",
      "required": [],
      "optional": []
    },
    {
      "name": "fullrestore",
      "description": "Fully heals the entire party, restoring all HP and MP and removing negative status effects. This is identical to the fullheal task.",
      "required": [],
      "optional": []
    },
    {
      "name": "fx",
      "description": "Plays a visual effect at a specified location. The effect can be placed at various positions: an actor's location, specific tile coordinates, or the camera position. The effect supports both world coordinates and screen coordinates with optional color tinting.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the visual effect to play"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The ID of an actor at whose position the effect should appear. If empty, uses task's actorID or coordinates"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinates where the effect should appear. If not provided, uses actor position or camera position"
        },
        {
          "name": "bools[0]",
          "description": "If true and tile coordinates are provided, the effect is tinted white for screen-space positioning"
        }
      ]
    },
    {
      "name": "fxOnParty",
      "description": "Plays the specified visual effect at the position of every party member simultaneously. This is useful for showing party-wide buffs, debuffs, or other effects.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the visual effect to play on each party member"
        }
      ]
    },
    {
      "name": "fxOnPlayerRank",
      "description": "Plays a visual effect at a specific UI location on the screen, positioned relative to the rank display in the escape menu's right info panel. The effect is tinted white for screen-space rendering.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the visual effect to play at the player rank UI location"
        }
      ],
      "optional": []
    },
    {
      "name": "fxOnTalker",
      "description": "Plays a visual effect at the position of the NPC the player is currently talking to. This is useful for adding visual feedback during conversations.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the visual effect to play at the talker's position"
        }
      ]
    },
    {
      "name": "gameOver",
      "description": "Triggers the game over sequence, ending the current game. This is used when the player has lost or a critical failure condition is met.",
      "required": [],
      "optional": []
    },
    {
      "name": "gc",
      "description": "Forces garbage collection to free up memory. This clears extra zones held in memory and runs the .NET garbage collector twice with finalizer waits. This is a debug/optimization command for managing memory usage.",
      "required": [],
      "optional": []
    },
    {
      "name": "getBribeAmount",
      "description": "Calculates and displays the bribe amount needed to appease enemies in combat. The amount is based on the power level of the actor's combat group (14% of their power level), and updates the first statement of the current dialog node to show this amount.",
      "required": [],
      "optional": []
    },
    {
      "name": "getItemsFromZone",
      "description": "Retrieves all items that can be picked up from another zone and spawns them at the specified tile coordinates in the current zone. The source zone is loaded temporarily, its items are extracted, and then the zone is unloaded.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the zone from which to extract items"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinates where the extracted items should be spawned in the current zone"
        }
      ],
      "optional": []
    },
    {
      "name": "get",
      "description": "Debug command that retrieves and displays the value of a global variable, trigger flag list, or evaluates a formula. If a variable name is provided, it shows that variable's value. If no argument is given, it lists all global variables that don't start with 'D_'.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The global variable name, trigger flag key, or formula to evaluate and display. If not provided, lists all non-dialog global variables"
        }
      ]
    },
    {
      "name": "getmod",
      "description": "Sets the recent mod ID reference used by the task system. This stores a Steam Workshop published file ID that can be referenced by other tasks for mod-related operations.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The Steam Workshop mod ID (as a number string) to store as the recent mod reference. If invalid or not provided, resets to 0"
        }
      ]
    },
    {
      "name": "getResponse_bribe",
      "description": "Determines the NPC's response to a bribe attempt during negotiation. The response is calculated based on power levels, hostility, and the speaker's actor type, then sets the next dialog node to the appropriate response. This uses the getNegotiationResponse method with intent='bribe', myPartyPowerLevel, threatPowerLevel, hostility (from floats[last]), and speakerActorTypeID.",
      "required": [
        {
          "name": "floats[last]",
          "description": "The hostility value to use in calculating the negotiation response (affects confidence and honor calculations)"
        }
      ],
      "optional": []
    },
    {
      "name": "getResponse_combat",
      "description": "Determines the NPC's response to a combat threat during negotiation. The response is calculated based on power levels, hostility, and the speaker's actor type, then sets the next dialog node to the appropriate response. This uses the getNegotiationResponse method with intent='combat', myPartyPowerLevel, threatPowerLevel, hostility (from floats[last]), and speakerActorTypeID.",
      "required": [
        {
          "name": "floats[last]",
          "description": "The hostility value to use in calculating the negotiation response (affects confidence and honor calculations)"
        }
      ],
      "optional": []
    },
    {
      "name": "getResponse_peace",
      "description": "Determines the NPC's response to a peaceful negotiation attempt. The response is calculated based on power levels, hostility, and the speaker's actor type, then sets the next dialog node to the appropriate response. This uses the getNegotiationResponse method with intent='peace', myPartyPowerLevel, threatPowerLevel, hostility (from floats[last]), and speakerActorTypeID.",
      "required": [
        {
          "name": "floats[last]",
          "description": "The hostility value to use in calculating the negotiation response (affects confidence and honor calculations)"
        }
      ],
      "optional": []
    },
    {
      "name": "giveActorsBaseXP",
      "description": "Awards base XP to all actors currently in the zone. This calls the awardBaseXP method on every actor, which typically grants a small amount of experience for participation.",
      "required": [],
      "optional": []
    },
    {
      "name": "giveFood",
      "description": "Adds a specified amount of food to the party's cargo inventory. Food is consumed during travel and is essential for long voyages.",
      "required": [
        {
          "name": "floats[last]",
          "description": "The amount of food to add to the cargo inventory"
        }
      ],
      "optional": []
    },
    {
      "name": "giveGlobalVarGP",
      "description": "Adds gold to the player's money equal to the value stored in a specified global variable. The global variable's numeric value is converted to an integer and added to the money total.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable whose value (as an integer) should be added to the player's money"
        }
      ],
      "optional": []
    },
    {
      "name": "giveItem",
      "description": "Gives the player a specified item with a specified quantity. The item is added to the party's inventory through the standard acquisition process, which handles stacking and inventory management.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The item type ID to give to the player"
        },
        {
          "name": "floats[0]",
          "description": "The quantity of the item to give (converted to integer)"
        }
      ],
      "optional": []
    },
    {
      "name": "giveMathXPToActorWithDialogNodeID",
      "description": "Awards calculated XP to all actors in the zone whose dialogNodeID matches the specified value. The XP amount is calculated by a formula, capped to not exceed the player's total XP, and must be non-negative. The XP is awarded without number display, party size effects, or tired state penalties.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to match - only actors with this dialogNodeID will receive XP"
        },
        {
          "name": "strings[1]",
          "description": "The formula string to calculate the amount of XP to award (evaluated as a numeric expression)"
        }
      ],
      "optional": []
    },
    {
      "name": "giveQuestItemReward",
      "description": "Gives the player gold based on the value of a quest item stored in the global variable 'tavern_questItem'. The item's value is added to the player's money and tracked in the 'earnedCashTotal' global variable.",
      "required": [],
      "optional": []
    },
    {
      "name": "giveShip",
      "description": "Grants the player a new ship by cloning an actor prefab and adding it to the player's fleet. The ship is made non-hostile, controllable, and assigned to the player faction. If the player has no fleet, a new fleet is initialized with this ship. The 'shipBoons' global variable is incremented to track ships received. A positive sound effect plays when the ship is granted.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The actor type ID of the ship to clone and give to the player (must be a boat-type actor)"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The unique ID to assign to the new ship. If not provided, generates an ID based on the ship type and shipBoons counter"
        }
      ]
    },
    {
      "name": "gm",
      "description": "Activates god mode for the player, massively boosting their stats. Sets HP and MP to 999, Physical and Magical Defense to 99, and grants rank 9 in all actions from all selectable classes. This is a debug/cheat command for testing or invincibility.",
      "required": [],
      "optional": []
    },
    {
      "name": "gob",
      "description": "Travels to a specified zone in build mode for level editing. If coordinates are provided, the player spawns at those coordinates; otherwise spawns at a default location. This is a debug command that sets flags to enter build mode upon zone entry. Zone names containing backslashes are rejected.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The zone ID to travel to. Must not contain backslashes"
        },
        {
          "name": "floats[0]",
          "description": "The X coordinate where the player should spawn in the zone"
        },
        {
          "name": "floats[1]",
          "description": "The Y coordinate where the player should spawn in the zone"
        }
      ]
    },
    {
      "name": "godmode",
      "description": "Activates god mode for the player, massively boosting their stats. Sets HP and MP to 999, Physical and Magical Defense to 99, and grants rank 9 in all actions from all selectable classes. This is a debug/cheat command for testing or invincibility.",
      "required": [],
      "optional": []
    },
    {
      "name": "go",
      "description": "Travels to a specified zone via the console. If coordinates are provided, the player spawns at those coordinates; otherwise spawns at a default location. This is a debug command for quick zone travel. Zone names containing backslashes are rejected.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The zone ID to travel to. Must not contain backslashes"
        },
        {
          "name": "floats[0]",
          "description": "The X coordinate where the player should spawn in the zone"
        },
        {
          "name": "floats[1]",
          "description": "The Y coordinate where the player should spawn in the zone"
        }
      ]
    },
    {
      "name": "gotoIf",
      "description": "Conditionally jumps to a specified dialog node if a formula evaluates to 1 or greater. The formula is evaluated with the task's actor as the target, and if the condition is met, the dialog immediately changes to the target node.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to jump to if the condition is true"
        },
        {
          "name": "strings[1]",
          "description": "The formula to evaluate - if the result is >= 1, the dialog jumps to the target node"
        }
      ],
      "optional": []
    },
    {
      "name": "gotoNodeDelay",
      "description": "Jumps to a specified dialog node after a delay. The delay prevents player interaction during the wait period, then triggers the dialog change via a timer. This is useful for creating timed transitions or pauses in conversations.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to jump to after the delay"
        },
        {
          "name": "floats[0]",
          "description": "The delay in seconds before jumping to the target dialog node"
        }
      ],
      "optional": []
    },
    {
      "name": "goToNodeID_plus_GlobalVar",
      "description": "Jumps to a dialog node whose ID is constructed by concatenating the current dialog node ID with the value of a global variable. For example, if currentDialogNodeID is 'node' and the global variable 'node' has value '5', it jumps to 'node5'. This allows dynamic dialog branching based on global state.",
      "required": [],
      "optional": []
    },
    {
      "name": "gotoNodeIf",
      "description": "Conditionally jumps to a specified dialog node if a formula evaluates to 1 or greater. The formula is evaluated with the task's actor as the target, and if the condition is met, the dialog immediately changes to the target node.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to jump to if the condition is true"
        },
        {
          "name": "strings[1]",
          "description": "The formula to evaluate - if the result is >= 1, the dialog jumps to the target node"
        }
      ],
      "optional": []
    },
    {
      "name": "gp",
      "description": "Adds gold to the player's money. If no amount is specified, adds 500 gold by default. This is a debug/cheat command for quick money.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The amount of gold to add to the player's money. Defaults to 500 if not provided"
        }
      ]
    },
    {
      "name": "grantXPShare_5percent",
      "description": "Distributes 5% of all accumulated class XP to all party members and barracked crew members if the XPShare global variable is enabled. For each class that has over 100 XP accumulated, each party/barracks member receives 5% of that XP in that class. The XP is awarded without visual numbers, unaffected by party size, and ignores tired state. This implements the shared experience mechanic.",
      "required": [],
      "optional": []
    },
    {
      "name": "handleDeaths",
      "description": "Processes actors who are dying by converting their 'dying' status to 'dead' once the dying duration expires. For controllable actors (party members), it queues a death cutscene with proper timing delays. For non-controllable actors (enemies), it immediately applies the 'dead' status and plays death visual effects (dust and smoke). Only processes actors if no death timer is currently active.",
      "required": [],
      "optional": []
    },
    {
      "name": "handleTiredStates",
      "description": "Manages the tired state for the party after combat or events. All active party members are fully healed (HP/MP restored) but given the 'tired' status effect. Barracks members are fully healed with max HP restoration based on the 'valueThisRun' global variable (currently always restores max HP due to 'true' condition).",
      "required": [],
      "optional": []
    },
    {
      "name": "healfaction",
      "description": "Fully heals all actors in the current zone that belong to a specified faction. The heal restores HP to full but does not restore maximum HP (injured state remains if applicable).",
      "required": [
        {
          "name": "strings[0]",
          "description": "The faction ID to heal (e.g., 'player', 'empire', 'guild')"
        }
      ],
      "optional": []
    },
    {
      "name": "heal",
      "description": "Heals an actor by a specified amount or fully heals the entire party. If no amount is provided, fully heals all party members. If amount is 0, it's treated as 9999 (effectively a full heal). Can target a specific actor by ID or use the task's actor.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The amount of HP to restore. If 0, treats as 9999. If not provided, fully heals the entire party instead"
        },
        {
          "name": "strings[0]",
          "description": "The ID of the actor to heal. If empty or not provided, heals the task's actor (or full party if no float provided)"
        }
      ]
    },
    {
      "name": "healparty",
      "description": "Fully heals all party members. This restores all party actors to full health.",
      "required": [],
      "optional": []
    },
    {
      "name": "help",
      "description": "Displays console command help information. If no command name is provided, lists all available console commands. If a command name is provided, shows detailed help for that specific command.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The name of the console command to get help for (e.g., 'heal', 'kill'). If not provided, lists all available commands"
        }
      ]
    },
    {
      "name": "hideEscWindows",
      "description": "Hides the escape menu windows including the main menu, left info panel, and right info panel. This clears the UI for cinematic or dialog sequences.",
      "required": [],
      "optional": []
    },
    {
      "name": "hidemapicon",
      "description": "Hides all map location icons in the 'eral' (overworld) zone by marking all locations as undiscovered. Only affects locations in the current zone. This is identical to 'hidemapicons'.",
      "required": [],
      "optional": []
    },
    {
      "name": "hidemapicons",
      "description": "Hides all map location icons in the 'eral' (overworld) zone by marking all locations as undiscovered. Only affects locations in the current zone. This is identical to 'hidemapicon'.",
      "required": [],
      "optional": []
    },
    {
      "name": "hideparty",
      "description": "Permanently hides all party members by setting their invisible timer to a very high value (99999) and making them not visible. This is identical to 'hidep'.",
      "required": [],
      "optional": []
    },
    {
      "name": "hideParty",
      "description": "Temporarily hides all party members by setting their invisible timer to a specified duration. The party will reappear after the timer expires.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The duration in seconds to keep the party invisible"
        }
      ],
      "optional": []
    },
    {
      "name": "hidep",
      "description": "Permanently hides all party members by setting their invisible timer to a very high value (99999) and making them not visible. This is identical to 'hideparty'.",
      "required": [],
      "optional": []
    },
    {
      "name": "hideQuickslots",
      "description": "Shows the quickslots UI by setting hideQuickslots to false. Despite the name, this actually makes quickslots visible rather than hiding them.",
      "required": [],
      "optional": []
    },
    {
      "name": "h",
      "description": "Displays help information for console commands. If no command name is provided, lists all available commands. If a command name is provided, shows the description for that specific command from the console command descriptions registry.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The name of the console command to get help about. If not provided, lists all available commands"
        }
      ]
    },
    {
      "name": "hostile",
      "description": "Marks the task's actor as hostile, making them aggressive and able to attack. This affects the actor specified by the task's actorID.",
      "required": [],
      "optional": []
    },
    {
      "name": "howmanyitems",
      "description": "Counts the number of items in the current zone and displays the count. If an item type ID is provided, counts only that type; otherwise counts all items on all tiles.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The item type ID to count. If not provided, counts all items in the zone"
        }
      ]
    },
    {
      "name": "howmany",
      "description": "Counts the number of items or actors in the current zone and displays the count. If an item or actor type ID is provided, counts only that type; otherwise counts all items. Also counts actors matching the specified actor type ID.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The item type ID or actor type ID to count. If not provided, counts all items in the zone"
        }
      ]
    },
    {
      "name": "howmanyWorld",
      "description": "Searches all zone data files in the world for occurrences of a specified text pattern and displays counts per zone plus a total. If no pattern is provided, attempts to use the item or actor under the mouse cursor. This is a debugging tool for finding object usage across the entire game world.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The text pattern to search for in zone files (e.g., 'actorTypeID=foo' or 'Item] ID=bar'). If not provided, uses the item or actor under the mouse cursor"
        }
      ]
    },
    {
      "name": "incDefaultNode",
      "description": "Increments the default dialog node ID of the task's actor. This changes the actor's dialogNodeID to the next sequential value (e.g., 'node1' becomes 'node2'), advancing their default conversation state.",
      "required": [],
      "optional": []
    },
    {
      "name": "incOnNewDay",
      "description": "Increments the actor's dialog node and changes to that new node, but only if at least 24 hours have passed since the last time this was executed. Uses a global variable to track the last execution time. The new dialog node priority is specified by the last float in the floats array.",
      "required": [
        {
          "name": "floats[floats.Count-1]",
          "description": "The priority value for the new dialog node when changing to it"
        }
      ],
      "optional": []
    },
    {
      "name": "initWaypoints",
      "description": "Forces a refresh of the AI waypoint system for the current zone. This recalculates pathfinding waypoints, useful after modifying the zone layout or blocking/unblocking areas.",
      "required": [],
      "optional": []
    },
    {
      "name": "investigator_fleetpos",
      "description": "Sets up the investigator's response for revealing fleet positions of a specified faction. If the faction is valid, enables tracking of that faction's fleets on the map for 30 days. Stores the response in a global variable for the investigator dialog system.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The faction ID whose fleet movements should be revealed and tracked"
        }
      ],
      "optional": []
    },
    {
      "name": "investigator_nearestLoc",
      "description": "Finds the nearest undiscovered location (excluding monster dens) to the current location and stores the result in a global variable for the investigator dialog system. Provides the location name and coordinates, or indicates if all locations are already discovered.",
      "required": [],
      "optional": []
    },
    {
      "name": "investigator_setoportselect",
      "description": "Generates dialog options for the investigator showing ports in a specified quadrant of the map that have unlockable items based on wealth investment. Creates dialog options listing what items can be unlocked at each port, dynamically building the menu based on the ports that match the quadrant and have investable unlocks.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to populate with the generated port options"
        },
        {
          "name": "floats[0]",
          "description": "The X direction sign for the quadrant (-1 for west, 1 for east)"
        },
        {
          "name": "floats[1]",
          "description": "The Y direction sign for the quadrant (-1 for north, 1 for south)"
        }
      ],
      "optional": []
    },
    {
      "name": "investigator_slainenemy",
      "description": "Finds an actor type that the player has killed but hasn't learned the journal entry for, then adds that journal entry to the player's knowledge. Stores the result in a global variable for the investigator dialog system, indicating success or that all possible entries are already known.",
      "required": [],
      "optional": []
    },
    {
      "name": "investigator_tradespecial",
      "description": "Reveals the next trade special (high-demand goods) location and item to the player. Refreshes the trade special system if needed while preserving the current one, then stores information about the upcoming special trade opportunity in a global variable for the investigator dialog.",
      "required": [],
      "optional": []
    },
    {
      "name": "invest",
      "description": "Invests gold at the current location, increasing favor with the player's faction and potentially changing the location's controlling faction. Also affects faction favor, increases location wealth level, and modifies fame values for trade and piracy. If the location changes faction, triggers a special event.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount of gold to invest at the location"
        }
      ],
      "optional": []
    },
    {
      "name": "jobDialogOptions",
      "description": "Dynamically generates dialog options for guild jobs at the current location. Creates dialog nodes for each available quest type (letter delivery, cargo acquisition, defeat faction, slay monsters, clear monster dens, salvage shipwrecks) with appropriate descriptions, rewards, and acceptance mechanics. Each job type has specific parameters and creates corresponding quest tracking variables.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to populate with the generated job options"
        }
      ],
      "optional": []
    },
    {
      "name": "killall",
      "description": "Kills all non-controllable, non-invincible actors in the current zone by dealing massive damage (99999 HP). This affects all enemy actors but spares controllable party members and invincible actors.",
      "required": [],
      "optional": []
    },
    {
      "name": "killcrew",
      "description": "Kills all crew members of non-controllable actors in the current zone by dealing massive damage (99999 HP) to each crew member, then applies the 'crewless' status effect to the ship actors. This leaves enemy ships without crew but doesn't destroy the ships themselves.",
      "required": [],
      "optional": []
    },
    {
      "name": "killFaction",
      "description": "Incapacitates all actors belonging to a specified faction in the current zone. The actors are marked as incapacitated but not fully killed, putting them in a downed state.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The faction ID whose members should be incapacitated"
        }
      ],
      "optional": []
    },
    {
      "name": "kill",
      "description": "Kills all hostile, non-controllable, non-invincible actors in the current zone by dealing massive damage (99999 HP). Actors whose IDs are in the strings array are excluded from being killed. This is useful for clearing hostile enemies while preserving specific actors.",
      "required": [],
      "optional": [
        {
          "name": "strings",
          "description": "Array of actor IDs to exclude from being killed. Any actor whose ID appears in this list will be spared"
        }
      ]
    },
    {
      "name": "k",
      "description": "Displays a debug list of all actor types the player has killed, showing the actor type ID and kill count for each. The output is wrapped to fit the screen width.",
      "required": [],
      "optional": []
    },
    {
      "name": "learnJournalEntry",
      "description": "Teaches the player a journal entry and optionally displays it in the journal UI. The first bool controls whether to show an alert, and the optional second bool controls whether to animate and display the journal.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The journal entry ID to learn and display"
        },
        {
          "name": "bools[0]",
          "description": "Whether to show an alert when learning the journal entry"
        }
      ],
      "optional": [
        {
          "name": "bools[1]",
          "description": "If false or not present, animates the journal and displays the new entry with special UI settings. If true, skips the journal display"
        }
      ]
    },
    {
      "name": "listav",
      "description": "Lists all actor values (AVs) in the game or shows details for a specific AV. If an AV ID is provided, displays detailed information about that AV. Otherwise, lists all non-rank/XP actor values in a formatted grid.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The actor value ID to get detailed information about. If not provided, lists all actor values"
        }
      ]
    },
    {
      "name": "listfx",
      "description": "Lists all visual/audio effects (FXs) in the game or shows details for a specific FX. If an FX ID is provided, displays detailed information about that FX. Otherwise, lists all available FX IDs.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The FX ID to get detailed information about. If not provided, lists all FX IDs"
        }
      ]
    },
    {
      "name": "loadItOnUpYo",
      "description": "Loads a new zone and moves the player to the specified tile coordinate position within that zone. The two floats control camera fade timing for the zone transition.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The zone ID to load and move to"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate position where the player should be placed in the new zone"
        },
        {
          "name": "floats[0]",
          "description": "The camera fade-out duration for the zone transition"
        },
        {
          "name": "floats[1]",
          "description": "The camera fade-in duration for the zone transition"
        }
      ],
      "optional": []
    },
    {
      "name": "loadModPageInBrowser",
      "description": "Opens the Steam Workshop page for the most recently loaded mod in the user's default web browser. This allows players to view mod details, subscribe/unsubscribe, or leave feedback.",
      "required": [],
      "optional": []
    },
    {
      "name": "loads",
      "description": "Loads a system save file by name. This is used for loading special save states, typically for debugging or specific game scenarios.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The system save file name to load"
        }
      ],
      "optional": []
    },
    {
      "name": "loadSpecialZone",
      "description": "Loads a special overlay zone at a specified screen position with optional depth, scale, and rendering settings. The position uses tile coordinates for standard positioning. The zone can be configured to only render when roofs are drawn.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The special zone ID to load and display"
        },
        {
          "name": "tileCoords[0]",
          "description": "The screen position (X, Y) where the special zone should be displayed"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The depth modifier for rendering the special zone"
        },
        {
          "name": "strings[1]",
          "description": "The scale multiplier for the special zone (must be parseable as a float)"
        },
        {
          "name": "bools[0]",
          "description": "If true, the special zone only draws when roofs are being rendered"
        }
      ]
    },
    {
      "name": "loadSpecialZone_playerFlagship",
      "description": "Loads the player's flagship boarding zone as a special overlay at a specified screen position with optional depth, scale, and rendering settings. Automatically determines the correct boarding zone based on the player's current flagship. The position uses tile coordinates for standard positioning.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The screen position (X, Y) where the flagship zone should be displayed"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The depth modifier for rendering the special zone"
        },
        {
          "name": "strings[1]",
          "description": "The scale multiplier for the special zone (must be parseable as a float)"
        },
        {
          "name": "bools[0]",
          "description": "If true, the special zone only draws when roofs are being rendered"
        }
      ]
    },
    {
      "name": "loadSpecialZone_playerFlagship_precision",
      "description": "Loads the player's flagship boarding zone as a special overlay at a precise screen position (divided by 100) with optional depth, scale, and rendering settings. Automatically determines the correct boarding zone based on the player's current flagship. The precision positioning allows for finer control than standard positioning.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The screen position (X, Y) where the flagship zone should be displayed, divided by 100 for precision positioning"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The depth modifier for rendering the special zone"
        },
        {
          "name": "strings[1]",
          "description": "The scale multiplier for the special zone (must be parseable as a float)"
        },
        {
          "name": "bools[0]",
          "description": "If true, the special zone only draws when roofs are being rendered"
        }
      ]
    },
    {
      "name": "loadSpecialZone_precision",
      "description": "Loads a special overlay zone at a precise screen position (divided by 100) with optional depth, scale, and rendering settings. The precision positioning allows for finer control than standard tile coordinate positioning. The zone can be configured to only render when roofs are drawn.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The special zone ID to load and display"
        },
        {
          "name": "tileCoords[0]",
          "description": "The screen position (X, Y) where the special zone should be displayed, divided by 100 for precision positioning"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The depth modifier for rendering the special zone"
        },
        {
          "name": "strings[1]",
          "description": "The scale multiplier for the special zone (must be parseable as a float)"
        },
        {
          "name": "bools[0]",
          "description": "If true, the special zone only draws when roofs are being rendered"
        }
      ]
    },
    {
      "name": "location_tryUnlockItems",
      "description": "Attempts to unlock items at the current location based on the location's wealth level and other criteria. This checks all potential unlockable items and makes them available if conditions are met.",
      "required": [],
      "optional": []
    },
    {
      "name": "lockCameraAt",
      "description": "Locks the camera at a specific position or actor, preventing player camera control. If a tile coordinate is provided, points the camera there with optional tracking speed and reveals fog of war. If no coordinate is given, tracks the task's actor or the current actor. The camera lock persists until released.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to fix the camera as if under a roof (affects rendering/lighting)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate to lock the camera at. If not provided, tracks an actor instead"
        },
        {
          "name": "floats[0]",
          "description": "The camera tracking speed when moving to the position. Only used if a tile coordinate is provided and is non-zero"
        }
      ]
    },
    {
      "name": "lookAtPlayer",
      "description": "Makes the task's actor turn to face the player character. Calculates the appropriate rotation based on the direction from the actor to the player and sets the actor's facing rotation. Uses delayed timers to ensure the rotation persists even if the actor is moving.",
      "required": [],
      "optional": []
    },
    {
      "name": "lookAtTalker",
      "description": "Makes the player character turn to face the task's actor (the talker in a dialog). Calculates the appropriate rotation based on the direction from the player to the actor and sets the player's facing rotation. Uses delayed timers to ensure the rotation persists even if the player is moving.",
      "required": [],
      "optional": []
    },
    {
      "name": "lootFleet_afterCombat",
      "description": "Opens the looting interface after fleet combat, allowing the player to transfer items from the defeated enemy fleet's cargo to their own. If an assist fleet is present, their cargo is first merged with the enemy fleet. The interface shows both the player's cargo and the enemy fleet's cargo with special UI settings.",
      "required": [],
      "optional": []
    },
    {
      "name": "lose10Food",
      "description": "Removes 10 food items from the player's cargo inventory. This is typically used for events, penalties, or consumption mechanics.",
      "required": [],
      "optional": []
    },
    {
      "name": "markDojoLocDone",
      "description": "Marks the current location's dojo training as complete by changing its map tooltip icon from 'sign_icon_muscle' to 'sign_icon_muscle_done'. This visually indicates that the training at this dojo has been completed.",
      "required": [],
      "optional": []
    },
    {
      "name": "markTrainerLocDone",
      "description": "Marks the current location's trainer as having completed one level of training by changing its map tooltip icon to the next stage. Handles both single and double book icons, progressing from 'sign_icon_book' to 'sign_icon_book_done' to 'sign_icon_book_done_done', and similarly for '2book' variants. This tracks multiple levels of training completion.",
      "required": [],
      "optional": []
    },
    {
      "name": "math",
      "description": "Evaluates a formula string and displays the result in the debug output. The formula is calculated using the player character as context. This is useful for testing formula expressions.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The formula string to evaluate (e.g., 'd:playerHP+10' or 'abs(-5)')"
        }
      ]
    },
    {
      "name": "maximizeWindowIfTrue",
      "description": "Maximizes the game window and hides the main menu background and UI if the boolean is true. This is used for fullscreen cinematic sequences or special display modes.",
      "required": [
        {
          "name": "bools[0]",
          "description": "If true, maximizes the window and hides background/UI elements"
        }
      ],
      "optional": []
    },
    {
      "name": "maximizeWindowSet",
      "description": "Sets the game window maximization state based on the boolean value. True maximizes the window, false restores it to normal size.",
      "required": [
        {
          "name": "bools[0]",
          "description": "True to maximize the window, false to restore to normal size"
        }
      ],
      "optional": []
    },
    {
      "name": "mergeSpecialZone",
      "description": "Merges the special zone into the current zone at a specified position. Special zones are pre-designed zone sections that can be dynamically integrated into the main zone. If a tile coordinate is provided, the special zone will be positioned at that location; otherwise, it uses the default position. This operation destroys any items that were previously in the special zone area.",
      "required": [],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y position where the special zone should be merged. If not provided, the special zone maintains its current position."
        }
      ]
    },
    {
      "name": "modFame",
      "description": "Modifies the player's fame value for a specific fame type by a given amount. Fame types track the player's reputation in different categories (such as combat, trading, etc.). Positive values increase fame, negative values decrease it.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The fame type identifier to modify (e.g., 'combat', 'trading')"
        },
        {
          "name": "floats[0]",
          "description": "The amount to modify the fame value by (positive to increase, negative to decrease)"
        }
      ],
      "optional": []
    },
    {
      "name": "modGlobalVar",
      "description": "Modifies a global variable by adding or subtracting a specified amount. Global variables are persistent numeric values that can be used to track quest progress, game state, or other data across the entire game session.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to modify"
        },
        {
          "name": "floats[0]",
          "description": "The amount to add to the global variable (can be negative to subtract)"
        }
      ],
      "optional": []
    },
    {
      "name": "modLocFavor",
      "description": "Modifies the player's favor (reputation) with the faction that controls the current location. This affects how NPCs in the location react to the player and what services/prices are available. Positive values increase favor, negative values decrease it.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount to modify the location's faction favor by (positive to increase, negative to decrease)"
        }
      ],
      "optional": []
    },
    {
      "name": "modLocWealthLevel",
      "description": "Modifies the wealth level of the current location. Wealth level determines the quality and availability of items for sale at the location. The value is automatically clamped between 0 and 100, and after modification, the location will attempt to unlock new items based on the new wealth level.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount to modify the location's wealth level by (positive to increase, negative to decrease). Final value is clamped between 0 and 100."
        }
      ],
      "optional": []
    },
    {
      "name": "modNodeIDGlobalVar_1",
      "description": "Increments a global variable named after the current dialog node ID by 1. This is commonly used to track how many times a specific dialog node has been visited. The variable name is automatically set to the current dialog node's ID.",
      "required": [],
      "optional": []
    },
    {
      "name": "modNodeIDGlobalVar_999",
      "description": "Adds 999 to a global variable named after the current dialog node ID. This is typically used to mark a dialog choice as 'permanently chosen' or 'completed', with the high value (999) making it easy to check if the dialog has been visited. The variable name is automatically set to the current dialog node's ID.",
      "required": [],
      "optional": []
    },
    {
      "name": "modPlayerFactionFavor",
      "description": "Modifies favor with the faction stored in the 'playerFaction' global variable. This is used for custom player-aligned factions set during gameplay. The favor amount can be specified either as a float value or as a formula string that will be calculated.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "A formula string to calculate the favor amount. Only used if floats[0] is not provided or is 0."
        },
        {
          "name": "floats[0]",
          "description": "The amount to modify the player faction's favor by. If 0 or not provided, uses the formula from strings[0] instead."
        }
      ]
    },
    {
      "name": "modTalkerFactionFavor",
      "description": "Modifies the player's favor with the faction that the current conversation partner (talker) belongs to. This allows dialog choices to affect reputation with the NPC's faction.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount to modify favor with the talker's faction by (positive to increase, negative to decrease)"
        }
      ],
      "optional": []
    },
    {
      "name": "modTalkerFavor",
      "description": "Modifies the player's favor with the faction that the task's actor belongs to. Only executes if the actor exists and belongs to a valid faction. This is typically used when an actor (specified by actorID) represents a faction member.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The amount to modify the actor's faction favor by (positive to increase, negative to decrease)"
        }
      ],
      "optional": []
    },
    {
      "name": "moveActor",
      "description": "Instantly teleports a specified actor to a new tile position and optionally sets their facing direction. The actor is moved immediately without pathfinding or animation.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to move"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate position to move the actor to"
        },
        {
          "name": "floats[0]",
          "description": "The facing rotation in degrees to set for the actor after moving"
        }
      ],
      "optional": []
    },
    {
      "name": "moveActor_point",
      "description": "Moves a specified actor to the nearest travel point with specific coordinates. Travel points are designated spawn/teleport locations in a zone. The actor will be positioned at the closest travel point that matches the specified point coordinates.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to move"
        },
        {
          "name": "tileCoords[0]",
          "description": "The X and Y coordinates of the travel point to search for (not the exact tile position, but the travel point ID)"
        },
        {
          "name": "floats[0]",
          "description": "The facing rotation in degrees to set for the actor after moving"
        }
      ],
      "optional": []
    },
    {
      "name": "moveAllActorsBy",
      "description": "Moves all actors in the current zone by a specified offset, keeping them within zone bounds. Also moves the camera by the same offset. Optionally sets the facing rotation for all actors. This is useful for shifting entire zone contents when merging zones or creating scene transitions.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y offset to move all actors by (relative movement, not absolute position)"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The facing rotation in degrees to set for all actors. If 0 or not provided, actor facing directions remain unchanged."
        }
      ]
    },
    {
      "name": "moveCamXY",
      "description": "Moves the camera's target position by a specified X and Y offset. The camera will smoothly pan to the new target position. This is relative movement, not absolute positioning.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The X offset to move the camera by"
        },
        {
          "name": "floats[1]",
          "description": "The Y offset to move the camera by"
        }
      ],
      "optional": []
    },
    {
      "name": "moveItems",
      "description": "Moves all items from a source tile coordinate to a destination tile coordinate. Items are removed from the source location and placed at the destination, forcing them to fit even if the destination would normally be full.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The destination tile coordinate where items should be moved to. The topLeftTC parameter (from task definition) specifies the source tile to remove items from."
        }
      ],
      "optional": []
    },
    {
      "name": "moveItemsToActor",
      "description": "Transfers all items from a specified tile coordinate to an actor's inventory. The actor will attempt to equip each item, and if the inventory is full, items will be dropped on the ground near the actor. All items at the source tile are then removed.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor who should receive the items"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate where the items to be transferred are located"
        }
      ],
      "optional": []
    },
    {
      "name": "moveJournal",
      "description": "Animates the journal window to move to a new screen position over a specified duration. The position can be specified as absolute coordinates, right-aligned coordinates, or centered on screen based on boolean flags.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y screen position to move the journal to (in pixels)"
        },
        {
          "name": "floats[0]",
          "description": "The duration of the movement animation in seconds"
        },
        {
          "name": "bools[0]",
          "description": "If true, the X position is treated as right-aligned (distance from right edge of screen)"
        },
        {
          "name": "bools[1]",
          "description": "If true, the journal is centered on screen, ignoring the tileCoords position"
        }
      ],
      "optional": []
    },
    {
      "name": "movement",
      "description": "Initiates smooth movement for a specified actor toward a target tile coordinate. The actor becomes intangible during movement, and pathfinding is cleared. Movement direction is calculated relative to the actor's current position, with -1 values preserving the current coordinate on that axis. Optionally plays a 'pain' animation and sets movement speed.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The target tile coordinate to move toward. Use -1 for X or Y to maintain the actor's current position on that axis."
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to move. If empty string or not provided, uses the task's actorID."
        },
        {
          "name": "bools[0]",
          "description": "If true, plays the 'pain' animation on the actor during movement"
        },
        {
          "name": "floats[0]",
          "description": "The movement speed to set for the actor. If 0 or not provided, uses the actor's default speed."
        }
      ]
    },
    {
      "name": "movePartyBy",
      "description": "Moves all party members by a specified offset, keeping them within zone bounds. Also moves the camera by the same offset to keep the party in view. Optionally sets the facing rotation for all party members.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y offset to move all party members by (relative movement, not absolute position)"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The facing rotation in degrees to set for all party members. If 0 or not provided, facing directions remain unchanged."
        }
      ]
    },
    {
      "name": "movePartyTo",
      "description": "Moves the entire party to a specified tile coordinate position and centers the camera on that location. When in travel mode, prevents immediate interaction for 0.5 seconds after the move. Optionally sets the facing rotation for all party members.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate position to move the party to"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The facing rotation in degrees to set for all party members. If 0 or not provided, facing directions remain unchanged."
        }
      ]
    },
    {
      "name": "movePartyTo_point",
      "description": "Moves the party to the nearest travel point with specified coordinates. Travel points are designated spawn locations in a zone. Optionally spawns all player fleet boats into the zone and distributes party members across multiple travel points with the same Y coordinate.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y coordinates of the travel point to search for (travel point ID, not exact tile position)"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If true, distributes party members across all travel points with matching Y coordinate (X=0 to any X)"
        },
        {
          "name": "bools[1]",
          "description": "If true and in a boat zone, spawns all boats from the player's fleet into the zone and adds them to the party"
        }
      ]
    },
    {
      "name": "moveSpecialZone",
      "description": "Initiates animated movement of the special zone to a target position. The special zone will smoothly move toward the target coordinates at a specified speed. Movement can use easing for smooth acceleration/deceleration, and can optionally yo-yo back to the starting position.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The target X and Y position for the special zone to move to (in tile coordinates)"
        },
        {
          "name": "bools[0]",
          "description": "If true, uses easing (smooth acceleration/deceleration) for the movement"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The movement speed. If 0 or not provided, uses the current special zone speed."
        },
        {
          "name": "bools[1]",
          "description": "If true, the special zone will yo-yo back to its starting position after reaching the target"
        }
      ]
    },
    {
      "name": "moveSpecialZone_precision",
      "description": "Initiates animated movement of the special zone to a precise target position using sub-tile precision. The coordinates are divided by 100 to allow fine-grained positioning (e.g., 150 becomes 1.5 tiles). Movement can use easing for smooth acceleration/deceleration, and can optionally yo-yo back to the starting position.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The target X and Y position in centitiles (divided by 100). For example, X=150 Y=250 becomes position (1.5, 2.5)."
        },
        {
          "name": "bools[0]",
          "description": "If true, uses easing (smooth acceleration/deceleration) for the movement"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The movement speed. If 0 or not provided, uses the current special zone speed."
        },
        {
          "name": "bools[1]",
          "description": "If true, the special zone will yo-yo back to its starting position after reaching the target"
        }
      ]
    },
    {
      "name": "moveToNewZone",
      "description": "Transitions the player and party to a different zone at a specified position. This triggers a zone change with an optional fade effect. After the transition, interaction is prevented for a brief period to allow the zone to settle.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The ID of the zone to move to"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate position where the party should appear in the new zone"
        },
        {
          "name": "floats[0]",
          "description": "The fade speed for the transition effect (0 for instant, higher values for slower fade)"
        }
      ],
      "optional": []
    },
    {
      "name": "moveX1",
      "description": "Sets the task's actor to move one tile in the positive X direction (right). The actor's movement vector is set directly, causing continuous movement until stopped by collision or another movement command.",
      "required": [],
      "optional": []
    },
    {
      "name": "moveXNeg1",
      "description": "Sets the task's actor to move one tile in the negative X direction (left). The actor's movement vector is set directly, causing continuous movement until stopped by collision or another movement command.",
      "required": [],
      "optional": []
    },
    {
      "name": "moveXY",
      "description": "Sets the task's actor to move in a specified direction using custom X and Y velocity values. The movement vector is set directly, causing continuous movement in the specified direction until stopped by collision or another movement command. Values are not normalized, so (2, 0) moves twice as fast as (1, 0).",
      "required": [
        {
          "name": "floats[0]",
          "description": "The X component of the movement vector (negative for left, positive for right)"
        },
        {
          "name": "floats[1]",
          "description": "The Y component of the movement vector (negative for up, positive for down)"
        }
      ],
      "optional": []
    },
    {
      "name": "moveY1",
      "description": "Sets the task's actor to move one tile in the positive Y direction (down). The actor's movement vector is set directly, causing continuous movement until stopped by collision or another movement command.",
      "required": [],
      "optional": []
    },
    {
      "name": "moveYNeg1",
      "description": "Sets the task's actor to move one tile in the negative Y direction (up). The actor's movement vector is set directly, causing continuous movement until stopped by collision or another movement command.",
      "required": [],
      "optional": []
    },
    {
      "name": "mpos",
      "description": "Toggles the debug display of the mouse cursor position on screen. This is a development/debugging tool that shows the current mouse coordinates. Each execution toggles the display on or off.",
      "required": [],
      "optional": []
    },
    {
      "name": "nextDialogNode_hideWindow",
      "description": "Sets a flag that causes the dialog window to hide when advancing to the next dialog node. This is used to create seamless transitions where dialog disappears before showing the next node, often for dramatic effect or when switching to a different UI mode.",
      "required": [],
      "optional": []
    },
    {
      "name": "noSpeechFXLookOrAnim",
      "description": "A no-op task that performs no action. This appears to be a placeholder or disabled task type, possibly used for testing or as a marker in dialog sequences. The task completes immediately without side effects.",
      "required": [],
      "optional": []
    },
    {
      "name": "offerRest",
      "description": "Offers the player the option to rest at the current location, but only if in travel mode. First checks if the area is safe for resting - if not safe, displays a warning message. If safe, presents a confirmation dialog asking if the player wants to rest. Resting typically restores HP and advances time.",
      "required": [],
      "optional": []
    },
    {
      "name": "openCargo",
      "description": "Opens the cargo/inventory management interface. This displays the player's item storage and allows transferring items between party members, ships, or containers. The interface is opened via the UI input handler.",
      "required": [],
      "optional": []
    },
    {
      "name": "openFleetWindow_delay",
      "description": "Schedules the fleet window to open after a brief delay (0.1 seconds). This delayed opening allows other UI elements or animations to complete before showing the fleet interface, preventing visual conflicts or timing issues.",
      "required": [],
      "optional": []
    },
    {
      "name": "openFleetWindow",
      "description": "Opens the fleet management window showing the player's fleet of ships. This interface displays all ships owned by the player, their crews, cargo, and stats, allowing the player to manage their naval forces.",
      "required": [],
      "optional": []
    },
    {
      "name": "openFleetWindow_talker",
      "description": "Opens the fleet management window showing the fleet belonging to the task's actor. This allows viewing or managing another character's fleet, typically used when interacting with NPC fleet commanders or examining enemy fleets.",
      "required": [],
      "optional": []
    },
    {
      "name": "openJournal_interactive",
      "description": "Opens the journal to a specific entry page in interactive mode, allowing the player to navigate and interact with it. If the journal is already visible, it animates a page turn before displaying the new entry. Unlike openJournal, this version always keeps interactive buttons enabled.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The journal entry number to display (cast to integer)"
        }
      ],
      "optional": []
    },
    {
      "name": "openJournal",
      "description": "Opens the journal to a specific entry page. If the journal is already visible, it animates a page turn before displaying the new entry. The journal displays both the specified entry and related entries, and can optionally hide all interactive buttons to create a read-only display for cutscenes.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The journal entry number to display (cast to integer)"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If true, hides all interactive buttons on the journal, making it display-only"
        }
      ]
    },
    {
      "name": "overseer",
      "description": "Switches the game to overseer mode, which is a special strategic view mode that allows top-down management of zones, actors, and game elements. This mode is typically used for zone editing, testing, or special gameplay sequences that require a bird's-eye perspective.",
      "required": [],
      "optional": []
    },
    {
      "name": "path",
      "description": "Calculates and assigns a movement path for a specified actor to reach a target tile coordinate. The actor will then follow this path automatically. Pathfinding can use either waypoint-based routing (which reverses the path) or standard AI pathfinding. Movement speed can optionally be customized.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The target tile coordinate to path to"
        },
        {
          "name": "bools[0]",
          "description": "If true, uses waypoint-based pathfinding (path is reversed after calculation). If false, uses standard AI pathfinding."
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The ID of the actor to path. If not provided or empty, uses the task's actorID."
        },
        {
          "name": "floats[0]",
          "description": "The movement speed to set for the actor. If 0 or not provided, uses the actor's default speed."
        }
      ]
    },
    {
      "name": "pathParty",
      "description": "Calculates and assigns movement paths for all party members to reach a target tile coordinate. Each party member will pathfind independently from their current position to the target, then follow their calculated path automatically.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The target tile coordinate that all party members should path to"
        }
      ],
      "optional": []
    },
    {
      "name": "peace",
      "description": "Peacefully resolves combat with nearby enemies, ending hostilities and awarding experience points. All actors within 18 tiles of the same faction as the task's actor become non-hostile, stop targeting enemies, and have their dialog changed from 'auto' to 'auto_peaceful'. The party receives XP based on the power level of the enemy combat group (105% of power level  0.9).",
      "required": [],
      "optional": []
    },
    {
      "name": "peaceXPrewardOnly",
      "description": "Awards experience points to the party based on the task actor's combat group power level, without actually ending combat or changing enemy behavior. This is the 'reward only' version of the peace task, giving the same XP calculation (105% of power level  0.9) but leaving enemies in their current state.",
      "required": [],
      "optional": []
    },
    {
      "name": "p",
      "description": "Creates and loads a procedurally generated zone with a specified template name. The zone is given an ID prefixed with 'p_' and the player is moved to position (10, 10) in the new zone. Optionally prevents the 'entering via console' flag from being set, which affects zone initialization behavior.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The procedural zone template name to use for generation. The actual zone ID will be 'p_' + this name."
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If false, prevents setting the 'entering via console' flag. If true or not provided, the flag is set (default behavior)."
        }
      ]
    },
    {
      "name": "placeActorFromBoardedShip",
      "description": "Spawns a crew member of a specific actor type from a boarded ship's crew into the current zone at a designated travel point. The task searches the boarded ship's crew for actors matching the specified type and places the first match at the travel point position, then adds them to the active zone.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The actor type ID to search for in the boarded ship's crew (e.g., 'pirate', 'merchant')"
        },
        {
          "name": "tileCoords[0]",
          "description": "The X and Y coordinates of the travel point where the crew member should be placed"
        }
      ],
      "optional": []
    },
    {
      "name": "playerAnim",
      "description": "Plays a specified animation on the player character. The animation is triggered immediately using the player actor's animator. Only executes if a player actor exists in the current zone.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The animation name/ID to play on the player character"
        }
      ],
      "optional": []
    },
    {
      "name": "playerFacingRot",
      "description": "Sets the player character's facing rotation to a specific angle and triggers a very brief delayed effect to update the visual facing. The rotation is applied immediately, and a timer triggers a 'facingRot' effect after 0.0001 seconds to ensure proper visual update.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The facing rotation angle in degrees to set for the player character"
        }
      ],
      "optional": []
    },
    {
      "name": "playerFlee",
      "description": "Allows the player to flee from combat by making all party members invisible and stopping nearby enemies from pursuing. All actors within 18 tiles of the same faction as the task's actor have their AI target cleared, their dialog reset (from 'auto' to empty), and are made to look at the player. Each party member receives increasing durations of invisibility (12s, 15s, 18s, etc.).",
      "required": [],
      "optional": []
    },
    {
      "name": "playerInitiateCombat",
      "description": "Forces the player to initiate combat with the task's actor. The game switches to travel mode, both the task's actor and player are set to idle animation, then the player character attacks the task's actor. The task's actorID is cleared after combat is initiated.",
      "required": [],
      "optional": []
    },
    {
      "name": "playerMoraleUp",
      "description": "Increases the morale actor value of all party members by 1 point, with a maximum value capped at 65. This provides a temporary boost to party morale without requiring any parameters.",
      "required": [],
      "optional": []
    },
    {
      "name": "playNearestLocationSong",
      "description": "Plays the external song associated with the nearest location to the player's current position. The location is determined by searching all locations (not just ports) and playing the song defined in that location's externalSong property.",
      "required": [],
      "optional": []
    },
    {
      "name": "playSong",
      "description": "Plays a specified song with customizable volume, pitch, delay, and override settings. Can play a custom song by ID, or special keywords like 'travelSong' or 'combatSong' to play the zone's travel or combat music. If no song is specified, stops all music. The song can override travel music changes and supports delayed playback.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Song ID to play. Special values: 'travelSong' or 'travel' plays the zone's travel song, 'combatSong' or 'combat' plays the zone's combat song. If empty or not provided, stops music"
        },
        {
          "name": "tileCoords[0].X",
          "description": "Volume percentage (0-100). The X coordinate is divided by 100 to get the volume value (e.g., 50 = 0.5 volume)"
        },
        {
          "name": "tileCoords[0].Y",
          "description": "Delay in seconds before the song starts playing. Use -99 if bools[1] is true to force immediate playback"
        },
        {
          "name": "bools[0]",
          "description": "If true, the song will override travel music changes (prevents automatic travel music from stopping this song)"
        },
        {
          "name": "floats[0]",
          "description": "Pitch adjustment for the song (0 = normal pitch, positive/negative values adjust pitch up/down)"
        },
        {
          "name": "bools[1]",
          "description": "If true, sets delay to -99 forcing immediate playback regardless of tileCoords[0].Y value"
        }
      ]
    },
    {
      "name": "pointCameraAt",
      "description": "Points the camera at a specific tile coordinate or tracks an actor. When pointing at coordinates, it reveals fog of war at that location and can set custom camera tracking speed. Can optionally lock the camera to prevent player changes and apply a roof-like visual effect.",
      "required": [
        {
          "name": "bools[0]",
          "description": "If true, prevents the camera from being changed by the player (locks camera control)"
        },
        {
          "name": "bools[1]",
          "description": "If true, fixes the camera as if the player is under a roof (applies visual darkening effect)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Tile coordinates to point the camera at. If provided, camera points at this fixed location and reveals fog of war there. If not provided, camera tracks an actor instead"
        },
        {
          "name": "floats[0]",
          "description": "Camera tracking speed when pointing at coordinates. Only used if tileCoords[0] is provided and floats[0] is not 0"
        },
        {
          "name": "strings[0]",
          "description": "Actor ID to track with the camera. Only used if tileCoords[0] is not provided. If this actor doesn't exist, falls back to the task's actorID or current actor"
        }
      ]
    },
    {
      "name": "preventInteraction",
      "description": "Prevents player interaction for a specified duration by setting a delay timer. This is commonly used during cutscenes or scripted events to ensure the player cannot interfere with the sequence.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Duration in seconds to prevent player interaction"
        }
      ],
      "optional": []
    },
    {
      "name": "quietsave",
      "description": "Performs an autosave without any notification or player interaction. This ignores hardcore mode restrictions, allowing saves even when they would normally be disabled.",
      "required": [],
      "optional": []
    },
    {
      "name": "rankstyle",
      "description": "Toggles the visual display style for ranks between notches and an alternative representation. This affects how rank progression is shown in the UI.",
      "required": [],
      "optional": []
    },
    {
      "name": "reactOnMatchingItems",
      "description": "Searches the entire zone for items of a specified type and triggers reactions when matching items face each other on adjacent tiles. If the facing item is the same type, both react with the 'matchedSelf' element; if different types, they react with the 'matched' element. This is useful for puzzle mechanics involving item placement and orientation.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID of the first item type to search for across the zone"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Item ID of the second item type that the first item should face. If empty or not provided, uses strings[0] (same item type). Items must be on adjacent tiles facing each other to trigger reactions"
        }
      ]
    },
    {
      "name": "readdVendorToParty",
      "description": "Re-adds a vendor actor to the party if they are found at a specified travel point and have a matching dialog node ID. The actor's dialog node is cleared, they are added to the party and fleet, and repositioned near the player. This is used to restore vendors who were temporarily removed.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Travel point number where the vendor actor should be located (e.g., 0 for travel_point0)"
        },
        {
          "name": "strings[0]",
          "description": "Dialog node ID that the actor must have to be re-added. This ensures only the correct vendor is affected"
        }
      ],
      "optional": []
    },
    {
      "name": "realtime",
      "description": "Toggles realtime mode on or off. Realtime mode affects game timing and behavior, switching between turn-based and real-time gameplay mechanics.",
      "required": [],
      "optional": []
    },
    {
      "name": "reassignQuestItem",
      "description": "Creates a new quest loot item, replaces its contents with a randomly selected quest item, and stores the new item's ID in the 'tavern_questItem' global variable. This is used to dynamically generate quest objectives.",
      "required": [],
      "optional": []
    },
    {
      "name": "recoverOverboardPartyActors",
      "description": "Recovers all party actors who went overboard by adding them back to the flagship's crew. Also removes any incapacitated or destroyed boats from the player's fleet. This is typically used after naval combat or when party members fell into water.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshloc",
      "description": "Adds any missing locations to the game world. This ensures all locations that should exist are present, typically used after new content is added or when locations need to be regenerated. Only works when not in the main menu zone.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshLocQuests",
      "description": "Refreshes the quest board at the current location by clearing all existing quests and generating new ones. This resets the available quests at the player's current location.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshRoyalQuests",
      "description": "Refreshes the available royal quests by generating new ones. This updates the special faction-based quest offerings from royal questgivers.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshRoyalTitle",
      "description": "Clears the player's royal title by setting the 'playerTitle' global variable to an empty string. This removes any earned title from the player.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshStatModifiers",
      "description": "Refreshes stat modifiers for all actors in the current zone. This recalculates and applies any stat bonuses or penalties from equipment, buffs, debuffs, or other sources affecting all actors.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshStatMods",
      "description": "Refreshes stat modifiers for all actors in the current zone, all party actors, and all actors in the barracks. This is a comprehensive refresh that recalculates stat bonuses/penalties across all relevant actor groups.",
      "required": [],
      "optional": []
    },
    {
      "name": "refreshUndamagedShipZones",
      "description": "Deletes saved zone data for all boats in the player's fleet, effectively resetting ship interiors to their undamaged state. This clears any damage or modifications to the internal zones of all fleet ships.",
      "required": [],
      "optional": []
    },
    {
      "name": "relocateActors",
      "description": "Relocates all actors within a specified radius of a center point to the outer edge of that radius. Actors matching an optional faction filter are moved to the nearest available tile outside the inner radius but within the outer boundary. Optionally plays a pain animation on relocated actors and clears party paths if party members are affected.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "Center tile coordinate from which actors will be relocated away"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Inner radius in tiles. Actors within this distance from the center are relocated. Defaults to 1 if not provided. Actors are moved to tiles outside this radius but within radius+3 tiles"
        },
        {
          "name": "strings[0]",
          "description": "Faction filter. If provided, only actors of this faction are relocated. If empty, all actors in the radius are affected"
        },
        {
          "name": "bools[0]",
          "description": "If true, plays the 'pain' animation on each relocated actor"
        }
      ]
    },
    {
      "name": "relocateActors_point",
      "description": "Relocates all actors within a specified radius of a center point to travel point markers. Actors matching an optional faction filter are placed on travel points of a specified set number. The placement can be restricted to unoccupied tiles only and randomized if desired.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "Center tile coordinate around which to search for actors to relocate"
        },
        {
          "name": "bools[0]",
          "description": "If true, only places actors on unoccupied travel point tiles"
        },
        {
          "name": "bools[1]",
          "description": "If true, randomizes which travel point each actor is placed on (rather than placing them sequentially)"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Radius in tiles from the center point to search for actors. Defaults to 1 if not provided"
        },
        {
          "name": "strings[0]",
          "description": "Faction filter. If provided, only actors of this faction are relocated. If empty, all actors in the radius are affected"
        },
        {
          "name": "strings[1]",
          "description": "Travel point set number (e.g., '0' for travel_point0, '1' for travel_point1, etc.). Defaults to 0 if not provided"
        }
      ]
    },
    {
      "name": "removeActorItem",
      "description": "Unequips and removes a specific item from an actor's inventory by item ID. The actor is specified by ID and the item is identified by its ID string.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID of the actor whose item will be removed"
        },
        {
          "name": "strings[1]",
          "description": "Item ID to unequip and remove from the actor's inventory"
        }
      ],
      "optional": []
    },
    {
      "name": "removeActor",
      "description": "Removes an actor from the zone by ID or by tile coordinate. Can optionally play a visual effect at the actor's location and transfer their inventory to the player's stash before removal.",
      "required": [
        {
          "name": "bools[0]",
          "description": "If true, plays a visual effect at the actor's position before removal. Defaults to 'actor_flee' effect unless strings[1] specifies a different effect"
        },
        {
          "name": "bools[1]",
          "description": "If true, transfers all items from the actor's inventory to the player's stash before removing the actor"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Actor ID to remove. Only used if tileCoords[0] is not provided"
        },
        {
          "name": "tileCoords[0]",
          "description": "Tile coordinate where the actor to remove is located. If provided, removes the actor at this position instead of using strings[0]"
        },
        {
          "name": "strings[1]",
          "description": "Custom visual effect ID to play when bools[0] is true. If not provided, uses 'actor_flee' as the default effect"
        }
      ]
    },
    {
      "name": "removeActors_despawnable",
      "description": "Removes all actors marked as despawnable from the current zone and special zone. Can optionally filter to only remove incapacitated/drowning actors, play visual effects on removal, and award XP for defeated hostile enemies. Also clears despawnable held actors.",
      "required": [
        {
          "name": "bools[0]",
          "description": "If true, plays the 'actor_flee' visual effect at each removed actor's position"
        },
        {
          "name": "bools[1]",
          "description": "If true, only removes actors that are incapacitated or drowning. Also awards XP during combat for defeated hostile enemies that give XP"
        }
      ],
      "optional": []
    },
    {
      "name": "removeActorType",
      "description": "Removes all actors of a specified actor type from the current zone. Can optionally play a visual effect when each actor is removed.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor type ID of actors to remove. All actors with this actorTypeID will be deleted from the zone"
        },
        {
          "name": "bools[0]",
          "description": "If true, plays the 'actor_flee' visual effect at each removed actor's position"
        }
      ],
      "optional": []
    },
    {
      "name": "removeAllItems",
      "description": "Removes all items of a specified ID from the entire zone or from a specific tile coordinate. The item ID can be provided directly or retrieved from a global variable. If a tile coordinate is specified, only items at that location are removed; otherwise, all items across the entire zone are removed.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove from the zone or tile. If strings[1] is provided, this parameter is ignored and the ID comes from the global variable instead"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to remove items from. If provided, only removes items at this location. If not provided, removes items from the entire zone"
        },
        {
          "name": "strings[1]",
          "description": "Global variable name containing the item ID to remove. If provided, the item ID is retrieved from this variable instead of using strings[0]"
        }
      ]
    },
    {
      "name": "removeAllItemsOfValue",
      "description": "Removes all items with a specific value from the entire zone. This searches every tile in the zone and removes items whose value matches the specified amount.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Item value to match. All items with this exact value will be removed from the zone"
        }
      ],
      "optional": []
    },
    {
      "name": "removeCargo_g",
      "description": "Removes a specified quantity of an item from the cargo inventory, where the item ID is retrieved from a global variable. This is the global-variable variant of removeCargo.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Global variable name containing the item ID to remove from cargo"
        },
        {
          "name": "floats[0]",
          "description": "Quantity of the item to remove from cargo"
        }
      ],
      "optional": []
    },
    {
      "name": "removeCargo",
      "description": "Removes a specified quantity of an item from the cargo inventory. This reduces the cargo hold's stock of the specified item by the given amount.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove from the cargo inventory"
        },
        {
          "name": "floats[0]",
          "description": "Quantity of the item to remove from cargo"
        }
      ],
      "optional": []
    },
    {
      "name": "removeEmptyItem",
      "description": "Searches the entire zone for items of a specified ID that are containers with no contents, and removes all such empty containers. This is useful for cleaning up empty chests or containers after their contents have been taken.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID of container items to check. Only containers of this ID that are empty (contain 0 items) will be removed"
        }
      ],
      "optional": []
    },
    {
      "name": "removeExcessLandingPartyActors",
      "description": "Removes all party actors from the zone who are not in the landing party list. This cleans up party members who should not be present in the current area, typically used when transitioning between zones with landing party restrictions.",
      "required": [],
      "optional": []
    },
    {
      "name": "removeFaction",
      "description": "Removes all actors of a specified faction from both the current zone and the special zone. This completely clears all members of the faction from the active zones.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Faction name of actors to remove. All actors with this faction will be deleted from the zone and special zone"
        }
      ],
      "optional": []
    },
    {
      "name": "removeFromFleet_slot",
      "description": "Removes a boat from the player's fleet at a specific slot index and attempts to place it on land at travel_point9. The boat is reconfigured for land storage, has crew/cargo modifiers removed, and gets a new dialog node for unmooring. If there is no room at the travel point, displays an error dialog instead.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Fleet slot index of the boat to remove (0-based index into the boats list)"
        }
      ],
      "optional": []
    },
    {
      "name": "removeFromParty",
      "description": "Removes a specified actor from the party without adding them to the barracks. Optionally can also remove them from the fleet. Returns false if the actor is not in the party, stopping task execution.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to remove from the party"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "If true, also removes the actor from the fleet in addition to removing them from the party. Defaults to false if not provided"
        }
      ]
    },
    {
      "name": "removeFromParty_slot",
      "description": "Removes a party member at a specific slot index and places them at travel_point0D markers for rehiring. The actor is fully healed, their equipment is transferred to the stash, and they get a 'crew_rehire' dialog node. If there is no room at the travel points, displays an error dialog instead.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Party slot index of the actor to remove (0-based index into the partyActors list)"
        }
      ],
      "optional": []
    },
    {
      "name": "removeHeldItems",
      "description": "Removes all items from the player's held items container. This clears any items the player is currently holding or has selected for interaction.",
      "required": [],
      "optional": []
    },
    {
      "name": "removeItemFromParty",
      "description": "Removes a specified quantity of an item from the party's collective inventory. Searches through all party members to find and remove the items.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove from the party's inventory"
        },
        {
          "name": "floats[0]",
          "description": "Quantity of the item to remove"
        }
      ],
      "optional": []
    },
    {
      "name": "removeItem_g",
      "description": "Removes a specified quantity of an item from the party's inventory, where the item ID is retrieved from a global variable. This is the global-variable variant of removeItemFromParty.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Global variable name containing the item ID to remove from the party"
        },
        {
          "name": "floats[0]",
          "description": "Quantity of the item to remove"
        }
      ],
      "optional": []
    },
    {
      "name": "removeItem",
      "description": "Removes a specified quantity of an item from various inventories with flexible targeting. Can remove from a specific tile coordinate, from the task actor's inventory, from party members' inventories, from the stash, or from held items. The item ID can be provided directly or retrieved from a global variable. Supports travel point coordinate mode.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove. If strings[1] is provided, this parameter is ignored and the ID comes from the global variable instead"
        },
        {
          "name": "floats[0]",
          "description": "Quantity of items to remove. Defaults to 1 if set to 0"
        },
        {
          "name": "bools[1]",
          "description": "If true and tileCoords[0] is provided, treats the coordinates as a travel point reference instead of a direct tile coordinate"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Global variable name containing the item ID to remove. If provided, the item ID is retrieved from this variable instead of using strings[0]"
        },
        {
          "name": "tileCoords[0]",
          "description": "Tile coordinate to remove items from. If provided, removes items from this location and skips inventory searches. If bools[1] is true, coordinates are used as travel point reference (X=point number, Y=set number)"
        }
      ]
    },
    {
      "name": "removeItemOfValue",
      "description": "Removes all items with a specific value from a specified tile coordinate. This searches the target tile and removes any items whose value matches the specified amount.",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "Tile coordinate to remove items from"
        },
        {
          "name": "floats[0]",
          "description": "Item value to match. All items at the tile with this exact value will be removed"
        }
      ],
      "optional": []
    },
    {
      "name": "removeitems",
      "description": "Removes all items of a specified type from the entire zone, or removes all items if no type is specified. This searches every tile in the zone and clears matching items.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove from the zone. If provided, only removes items of this ID. If not provided, removes all items from every tile"
        }
      ]
    },
    {
      "name": "removeItemsNearPlayerActor",
      "description": "Removes items of a specified ID within a radius of the player actor's position. The item ID can be provided directly or retrieved from a global variable. This searches all tiles within the specified distance and removes matching items.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item ID to remove near the player. If strings[1] is provided, this parameter is ignored and the ID comes from the global variable instead"
        },
        {
          "name": "floats[0]",
          "description": "Radius in tiles from the player actor's position. Items within this distance will be removed"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Global variable name containing the item ID to remove. If provided, the item ID is retrieved from this variable instead of using strings[0]"
        }
      ]
    },
    {
      "name": "removeTalker",
      "description": "Removes the actor who is currently talking (the actor associated with this task's actorID). This is typically used during dialog to remove the NPC after the conversation.",
      "required": [],
      "optional": []
    },
    {
      "name": "removeTempPartyActors",
      "description": "Removes all temporary party members who cannot be fully controlled from the party, missing party list, and overboard list. This cleans up quest companions or other temporary allies who should not remain in the party permanently.",
      "required": [],
      "optional": []
    },
    {
      "name": "removeTrigger",
      "description": "Removes a trigger from the current zone by its string ID. This deletes the trigger permanently from the zone.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Trigger ID to remove from the zone. If not provided or if the trigger doesn't exist, no action is taken"
        }
      ]
    },
    {
      "name": "removeZoneFX",
      "description": "Removes a zone-wide visual effect by its ID. Can optionally remove all instances of the effect or just the first one.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone FX ID to remove"
        },
        {
          "name": "bools[0]",
          "description": "If true, removes all instances of this FX from the zone. If false, removes only the first instance"
        }
      ],
      "optional": []
    },
    {
      "name": "renameShip",
      "description": "Opens the character name editor UI for the most recently added boat in the player's fleet, allowing the player to rename their newest ship. The UI cannot be closed without completing the naming.",
      "required": [],
      "optional": []
    },
    {
      "name": "repairFleet_free",
      "description": "Repairs all boats in the player's fleet to full health without charging any money. This is a free repair service, typically offered as a quest reward or special event.",
      "required": [],
      "optional": []
    },
    {
      "name": "repairFleet_pay",
      "description": "Deducts the repair cost from the player's money and repairs all boats in the player's fleet to full health. The cost is calculated with faction favor reduction applied.",
      "required": [],
      "optional": []
    },
    {
      "name": "replaceEquipment",
      "description": "Replaces an actor's equipped item in a specific inventory slot with a new item. The item category (weapon, armor, accessory) determines which slot is used, with automatic slot assignment for armor and accessories if slot 0 is specified. The old item is unequipped and the new item is equipped without dropping items on the ground.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID whose equipment will be replaced"
        },
        {
          "name": "strings[1]",
          "description": "Item ID of the new equipment to create and equip"
        },
        {
          "name": "floats[0]",
          "description": "Inventory slot number to replace. For weapons, uses this slot directly. For armor, if 0 is specified, uses slot 2. For accessories, if 0 is specified, uses slot 3"
        }
      ],
      "optional": []
    },
    {
      "name": "replaceTriggerWithZoneSeries",
      "description": "Loads a special zone and merges it into the current zone at a specified location, applying terrain replacers and item removers. The zone name is built by appending a global variable value to the base zone name, allowing sequential zone loading. After merging, increments the global variable to track progression through the series.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Base zone ID that will have a global variable value appended to it to load the next zone in the series"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Level data string to apply terrain replacers and item removers during zone merge"
        }
      ]
    },
    {
      "name": "researchFromFleet_slot",
      "description": "Submits a boat from the player's fleet for research at a shipwright location. Checks if the boat is already being researched or already researched, verifies the location has room (max 8 research slots), deducts the boat's value from player money, transfers the boat's cargo to player inventory, and removes the boat from the fleet. The location gains the ability to build this boat type after research completion.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Fleet slot index (0-based) of the boat to submit for research"
        }
      ],
      "optional": []
    },
    {
      "name": "research_report",
      "description": "Generates a dynamic dialog node that displays all unsold journal entries the player has discovered, categorizing them by rarity (mundane, oddity, interesting, etc.) and calculating rewards and fame for each. Higher rarity discoveries grant more money and fame, with special dialogue for legendary discoveries (rarity 7). Marks all reported entries as sold to prevent duplicate rewards.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to populate with the research report statements and rewards"
        }
      ],
      "optional": []
    },
    {
      "name": "resetachievements",
      "description": "Resets all Steam achievements and statistics for the game. This is a debugging/testing task that requires Steam API to be initialized.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetAllTileReactTimers",
      "description": "Resets the reaction timer for every tile in the current zone. This allows tiles with timed reactions or effects to be triggered again immediately, useful for debugging or resetting environmental interactions.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetFleetAI",
      "description": "Resets the AI state for all fleets in the game. Clears their pathfinding data, resets their waypoint destinations, and clears AI variables. This can be used to force fleets to recalculate their navigation and behavior.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetfog",
      "description": "Resets the fog of war for the entire current zone, marking all tiles as unknown/unexplored. This hides the map from the player and requires them to explore it again to reveal tiles.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetlocation",
      "description": "Resets a specific location to its initial state, clearing any changes or progress made there. If no location ID is provided, this task has no effect.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Location ID to reset"
        }
      ]
    },
    {
      "name": "resetlocations",
      "description": "Resets all locations in the game to their initial state, clearing any changes or progress made at any location.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetLocations",
      "description": "Resets all locations in the game to their initial state, clearing any changes or progress made at any location. This is functionally identical to resetlocations.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetloc",
      "description": "Resets a specific location to its initial state, clearing any changes or progress made there. If no location ID is provided, this task has no effect. This is functionally identical to resetlocation.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Location ID to reset"
        }
      ]
    },
    {
      "name": "resetPCDialogWindowSizeY",
      "description": "Resets the vertical size of the PC (player character) dialog window to its default dimensions. This is useful after dynamically resizing the dialog window to restore normal size.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetprocgen",
      "description": "Resets all procedurally generated locations in the game, clearing any changes or progress made at procedurally generated areas and allowing them to be regenerated.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetTrigger",
      "description": "Resets a trigger in the current zone, allowing it to be activated again. The trigger can be specified either by name (via string) or by numeric ID (via float). If both are provided, the string name takes precedence.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Numeric trigger ID to reset (used if strings[0] is empty or the named trigger doesn't exist)"
        },
        {
          "name": "strings[0]",
          "description": "Trigger name/ID to reset (takes precedence over numeric ID if non-empty)"
        }
      ],
      "optional": []
    },
    {
      "name": "resetwaypoint",
      "description": "Reinitializes the AI waypoint system for the current zone, forcing a refresh of all waypoint data. This rebuilds the pathfinding graph for AI navigation.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetwaypoints",
      "description": "Reinitializes the AI waypoint system for the current zone, forcing a refresh of all waypoint data. This rebuilds the pathfinding graph for AI navigation. Functionally identical to resetwaypoint.",
      "required": [],
      "optional": []
    },
    {
      "name": "resetwp",
      "description": "Reinitializes the AI waypoint system for the current zone, forcing a refresh of all waypoint data. This rebuilds the pathfinding graph for AI navigation. Functionally identical to resetwaypoint.",
      "required": [],
      "optional": []
    },
    {
      "name": "resize",
      "description": "Queues a display resolution change for the game window. The resolution change will be applied on the next frame. If fewer than 2 floats are provided, no change occurs.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "New display width in pixels"
        },
        {
          "name": "floats[1]",
          "description": "New display height in pixels"
        }
      ]
    },
    {
      "name": "res",
      "description": "Sets the game resolution to 1920x959 in windowed mode. This appears to be a debugging or testing task for applying a specific resolution configuration.",
      "required": [],
      "optional": []
    },
    {
      "name": "rest",
      "description": "Fully heals all party members, restoring their HP, curing all status effects, and resetting their state. This simulates a rest period for the party.",
      "required": [],
      "optional": []
    },
    {
      "name": "retro",
      "description": "Toggles the retro visuals mode on or off, switching between modern and retro-style graphics rendering.",
      "required": [],
      "optional": []
    },
    {
      "name": "returnMissingPartyMembers",
      "description": "Returns any party members who are missing or separated from the party back to the active party roster.",
      "required": [],
      "optional": []
    },
    {
      "name": "returnPath",
      "description": "Travels to a previously set return path location. If in combat mode, asks the player about fleeing. If not in combat or action mode, performs an autosave and moves the player to the specified zone and coordinates with the specified rotation. The tileCoords[0] position is used for the destination.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Player rotation angle at the destination"
        }
      ],
      "optional": []
    },
    {
      "name": "reviveall",
      "description": "Revives all incapacitated actors in the current zone, restoring them to full health and resetting their busy state. Actors listed in the strings array are excluded from revival. Temporarily prevents despawn during revival to ensure actors remain in the zone.",
      "required": [],
      "optional": [
        {
          "name": "strings[...]",
          "description": "Actor IDs to exclude from revival (checked via strings.Contains)"
        }
      ]
    },
    {
      "name": "revive",
      "description": "Revives a specific actor, restoring their HP by the specified amount (defaults to 9999 if 0). If bools[0] is true, also cures all status effects. Can target a named actor via strings[0] or the task's actorID if no name is provided.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Amount of HP to restore (uses 9999 if value is 0)"
        },
        {
          "name": "strings[0]",
          "description": "Actor ID to revive (empty string uses the task's actorID)"
        },
        {
          "name": "bools[0]",
          "description": "Whether to also cure all status effects after reviving"
        }
      ],
      "optional": []
    },
    {
      "name": "royalJobDialogOptions",
      "description": "Dynamically generates dialog options for royal faction quests based on global variables for quest type and goal. Quest types include letter delivery, cargo acquisition, fleet defeats (regular/battle/elite), alliance making, item acquisition, and grove discovery. Creates temporary dialog nodes with quest descriptions, acceptance/decline options, and sets up global variables for quest tracking including questType, questGoal, questLog, and questGiver.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to populate with the dynamically generated royal job options"
        }
      ],
      "optional": []
    },
    {
      "name": "safe",
      "description": "Marks the current zone as safe, preventing enemy spawns or hostile encounters.",
      "required": [],
      "optional": []
    },
    {
      "name": "save",
      "description": "Saves the game with an optional custom save name. If a save name is provided and already exists, appends '+' characters to make it unique. If no save name is provided, performs an autosave instead (ignoring hardcore mode restrictions).",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Custom save name (if empty, performs autosave instead)"
        }
      ]
    },
    {
      "name": "scaleCameraTo",
      "description": "Scales the camera to a target zoom level. If tileCoords[0].X is 0 or negative, instantly sets the camera scale. Otherwise, smoothly transitions to the target scale with a speed based on the X coordinate divided by 10.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Target camera scale/zoom level"
        }
      ],
      "optional": []
    },
    {
      "name": "scaleSpecialZone",
      "description": "Sets the target scale for the currently loaded special zone. If floats[0] is greater than 0, also sets the scaling speed. The scale value is parsed from strings[0] as a float.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Target scale value for the special zone (parsed as float)"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Scaling speed (only applied if greater than 0)"
        }
      ]
    },
    {
      "name": "scoreScreen",
      "description": "Displays a mission score screen showing total money earned, special loot converted to cash, surviving party members, and XP earned. Converts items with 'convertIntoCashAtEnd' property to money and items with 'setGlobalVarWhenConverted' to global variables (like crafting kits or class unlocks). Calculates total mission value, awards XP equally among survivors, and sets up global variables for mission success tracking. The screen uses animated coin sound effects and dynamic text generation.",
      "required": [],
      "optional": []
    },
    {
      "name": "scoreScreenResponse",
      "description": "Selects an appropriate follow-up dialog node after the score screen based on profit level (no/low/med/high) and death count (none/one/many). Searches for matching dialog nodes with the pattern 'score_{profit}_{deaths}' and chooses the least-used one to provide variety. Increments usage counter for the selected node and defaults to 'goToTown' if no matching nodes exist.",
      "required": [],
      "optional": []
    },
    {
      "name": "screenDarkWaveEffect",
      "description": "Applies a wave distortion effect to the screen's darkness shader. Sets the wave frequency and activates a time modifier to animate the effect. Only updates if the frequency differs from the current value.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Wave sine frequency for the darkness shader effect"
        }
      ],
      "optional": []
    },
    {
      "name": "screenpic",
      "description": "Captures a screenshot and displays it as a persistent overlay on screen. Can optionally load a special zone to screenshot and apply color palette swaps. With 0 strings, takes a regular screenshot. With 1 string, applies palette swap to current view. With 2 strings, loads a special zone (strings[1]) and applies palette swap (strings[0]). The screenshot is added to the indefinite draw queue and overlays the game view.",
      "required": [
        {
          "name": "floats[0]",
          "description": "X coordinate for screenshot center (in tile coordinates)"
        },
        {
          "name": "floats[1]",
          "description": "Y coordinate for screenshot center (in tile coordinates)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Palette ID to apply color swap to the screenshot"
        },
        {
          "name": "strings[1]",
          "description": "Special zone ID to load and screenshot (instead of current view)"
        }
      ]
    },
    {
      "name": "screenscale",
      "description": "Forces the screen scale to a specific value, overriding automatic scaling. If floats[0] is -1, disables forced scaling and returns to automatic scaling.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Forced screen scale value (use -1 to disable forced scaling)"
        }
      ],
      "optional": []
    },
    {
      "name": "screenshot",
      "description": "Captures a screenshot and saves it to the desktop. Can optionally load a special zone to screenshot and apply color palette swaps. With 0 strings, takes a regular screenshot. With 1 string, applies palette swap to current view. With 2 strings, loads a special zone (strings[1]) and applies palette swap (strings[0]). The file is saved with name 'screen' followed by the game time.",
      "required": [
        {
          "name": "floats[0]",
          "description": "X coordinate for screenshot center (in tile coordinates)"
        },
        {
          "name": "floats[1]",
          "description": "Y coordinate for screenshot center (in tile coordinates)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Palette ID to apply color swap to the screenshot"
        },
        {
          "name": "strings[1]",
          "description": "Special zone ID to load and screenshot (instead of current view)"
        }
      ]
    },
    {
      "name": "screenWaveEffect",
      "description": "Applies a wave distortion effect to the screen shader. Sets the wave frequency and activates a time modifier to animate the effect. Only updates if the frequency differs from the current value.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Wave sine frequency for the screen shader effect"
        }
      ],
      "optional": []
    },
    {
      "name": "script",
      "description": "Executes a Lua script by name. The script is loaded and run through the Lua manager, allowing for custom scripting logic.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Lua script name/ID to execute"
        }
      ],
      "optional": []
    },
    {
      "name": "sendAISignal",
      "description": "Sends an AI signal to nearby actors within a specified range. The signal is broadcast from the position of the actor executing the task (or a specific position if the actor exists). Other AI-controlled actors can respond to this signal based on their scripting.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Signal name/type to broadcast to nearby AI actors"
        },
        {
          "name": "floats[0]",
          "description": "Range/radius in which the signal can be received by other actors"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorAIActions",
      "description": "Sets the queued AI actions for a specific actor. The actions are assigned via DataManager's string value assignment system, allowing specification of a comma-separated list of AI actions to queue. The 'overwriteLists' and 'includeEmptyEntriesInList' flags are set to true for proper list handling.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID whose AI actions to set"
        },
        {
          "name": "strings[1]",
          "description": "Comma-separated list of AI actions to queue for the actor"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorAI",
      "description": "Sets an actor's AI script to a new Lua script. Optionally runs the script once immediately after setting it. The actor is identified by strings[0].",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID whose AI script to change"
        },
        {
          "name": "strings[1]",
          "description": "Lua script name to assign as the actor's AI behavior"
        },
        {
          "name": "bools[0]",
          "description": "Whether to immediately execute the script once after setting it (uses strings[0] as script parameter)"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorBool",
      "description": "Sets a boolean field on an actor to true if either floats[0] is greater than 0 or bools[0] is true. The field name is specified by strings[1] and is set using DataManager's value assignment system which supports setting any public field on the actor.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "Field name on the actor to set (e.g., 'canDespawn', 'invulnerable')"
        },
        {
          "name": "floats[0]",
          "description": "If greater than 0, sets the field to true (OR'd with bools[0])"
        },
        {
          "name": "bools[0]",
          "description": "If true, sets the field to true (OR'd with floats[0] > 0)"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorDialogNodeID",
      "description": "Sets the dialog node ID for an actor, determining which dialog tree they use when interacted with.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "Dialog node ID to assign to the actor"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorFloat",
      "description": "Sets a float field on an actor to a specific value. The field name is specified by strings[1] and is set using DataManager's value assignment system which supports setting any public float field on the actor.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "Field name on the actor to set (e.g., 'aiVarX', 'speed', any float property)"
        },
        {
          "name": "floats[0]",
          "description": "Value to assign to the field"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorIdleAnimOverride",
      "description": "Overrides an actor's idle animation with a custom animation. This replaces their default idle animation with the specified animation ID.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "Animation ID to use as the idle animation override"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorName",
      "description": "Changes an actor's display name to a new value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "New name to assign to the actor"
        }
      ],
      "optional": []
    },
    {
      "name": "setActorPalettes",
      "description": "Sets all three color palettes (armor, skin, and cloth) for an actor to the same palette ID, effectively recoloring the actor uniformly.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "Palette ID to apply to armor, skin, and cloth palettes"
        }
      ],
      "optional": []
    },
    {
      "name": "setAI_idle_flag",
      "description": "Sets the AI script of the actor executing this task to the 'idle_flag' script, making them perform an idle flag-holding animation or behavior.",
      "required": [],
      "optional": []
    },
    {
      "name": "setAI_idle",
      "description": "Sets the AI script of the actor executing this task to the 'idle' script, making them stand idle.",
      "required": [],
      "optional": []
    },
    {
      "name": "setAsDialogNode",
      "description": "Sets the dialog node ID for the actor executing this task. If strings[0] is provided, uses that node ID. Otherwise, uses the current dialog node ID from the dialog system.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to assign (if empty, uses currentDialogNodeID)"
        }
      ]
    },
    {
      "name": "setAsMyNode",
      "description": "Sets the dialog node ID for the actor associated with this task. If a node ID is provided in strings[0], it uses that value; otherwise, it defaults to the current dialog node ID. This controls which dialog conversation the actor will use when interacted with.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the actor. If not provided, uses the current dialog node ID instead."
        }
      ]
    },
    {
      "name": "setBPC",
      "description": "Sets body part connection data for a specific body structure. Adds visual connection data between body parts, including the player's facing rotation and position offsets. Used for customizing character model part connections.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The body structure ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "The body part connection name within the structure to configure"
        },
        {
          "name": "floats[0]",
          "description": "The X position offset for the connection"
        },
        {
          "name": "floats[1]",
          "description": "The Y position offset for the connection"
        }
      ],
      "optional": []
    },
    {
      "name": "setBP",
      "description": "Sets the origin point (pivot point) for a body part in a body structure. The origin determines where the body part is positioned and rotated from. Used for customizing character model appearance and animation.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The body structure ID to modify"
        },
        {
          "name": "strings[1]",
          "description": "The body part name within the structure"
        },
        {
          "name": "floats[0]",
          "description": "The X coordinate of the body part origin"
        },
        {
          "name": "floats[1]",
          "description": "The Y coordinate of the body part origin"
        }
      ],
      "optional": []
    },
    {
      "name": "setBuyPriceMult",
      "description": "Sets the global buy price multiplier that affects how much items cost when purchasing from vendors. A value of 1.0 is normal pricing, values greater than 1.0 make items more expensive, and values less than 1.0 make items cheaper.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The multiplier to apply to all buy prices (1.0 = normal, 0.5 = half price, 2.0 = double price)"
        }
      ],
      "optional": []
    },
    {
      "name": "setCombatUIVisible",
      "description": "Controls the visibility of the combat user interface elements. Can be used to show or hide combat UI during battles or special sequences.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to show (true) or hide (false) the combat UI"
        }
      ],
      "optional": []
    },
    {
      "name": "setCurrentActor_partSpritesThatTakePriorityOverClass",
      "description": "Sets which body part sprites should take priority over the default class sprites for the current actor. This allows customizing character appearance by overriding specific body parts regardless of the character's class. The value is assigned using overwriteLists mode.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Comma-separated list of body part sprite names that should override class defaults"
        }
      ],
      "optional": []
    },
    {
      "name": "setDefaultNodeIf",
      "description": "Conditionally sets the dialog node ID for the actor associated with this task based on a formula evaluation. The dialog node is only changed if the formula evaluates to 1 or greater. This allows dynamic dialog routing based on conditions.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the actor if the condition is met"
        },
        {
          "name": "strings[1]",
          "description": "A formula that is evaluated against the actor. If the result is >= 1, the dialog node is changed."
        }
      ],
      "optional": []
    },
    {
      "name": "setDefaultNode",
      "description": "Sets the dialog node ID for the actor associated with this task. If a node ID is provided in strings[0], it uses that value; otherwise, it defaults to the current dialog node ID. This controls which dialog conversation the actor will use when interacted with.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the actor. If not provided, uses the current dialog node ID instead."
        }
      ]
    },
    {
      "name": "setDialogSpeed",
      "description": "Sets the global dialog speed multiplier that controls how quickly dialog text appears on screen. A value of 1.0 is normal speed, higher values make text appear faster, and lower values make it appear slower.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The speed multiplier for dialog text display (1.0 = normal, 2.0 = double speed, 0.5 = half speed)"
        }
      ],
      "optional": []
    },
    {
      "name": "setDialogWindowSizeYAuto",
      "description": "Automatically resizes the NPC dialog window height to fit the content. This allows the dialog window to adjust its vertical size based on the amount of text or options being displayed.",
      "required": [],
      "optional": []
    },
    {
      "name": "setDialogWindowSizeY",
      "description": "Sets the vertical size of the NPC dialog window. If a float value is provided, it uses that value; otherwise it uses the last float in the floats array. The window is resized to the specified height.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The height value for the NPC dialog window. If not provided, uses the last value in the floats array."
        }
      ]
    },
    {
      "name": "setFaceSprite",
      "description": "Sets the sprite (visual appearance) for the 'face' body part of the actor associated with this task. This allows changing an actor's facial appearance dynamically during dialog or events.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The sprite ID to use for the actor's face body part"
        }
      ],
      "optional": []
    },
    {
      "name": "setFactionAI",
      "description": "Sets the AI script behavior for all actors belonging to a specific faction. This controls how members of that faction behave in the game world and during combat.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The faction ID whose AI behavior to modify"
        },
        {
          "name": "strings[1]",
          "description": "The AI script name to assign to the faction"
        }
      ],
      "optional": []
    },
    {
      "name": "setFactionHostile",
      "description": "Sets whether a faction is hostile or friendly toward the player. When floats[0] is >= 1, the faction becomes hostile; otherwise it becomes friendly. The third parameter (clearDialogNodeID) is determined by whether tileCoords[0] was provided.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The faction ID to make hostile or friendly"
        },
        {
          "name": "floats[0]",
          "description": "Whether to make the faction hostile (>= 1.0) or friendly (< 1.0)"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "If provided, determines whether to clear dialog node IDs for faction members (presence means clear them)"
        }
      ]
    },
    {
      "name": "setFog",
      "description": "Sets the fog of war visibility state for a rectangular area of tiles on the zone map. The area is centered on tileCoords[0] with a radius specified by floats[0]. The visibility state (known/unknown) is set by bools[0]. Can optionally target a different zone by specifying its ID in strings[0].",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The center tile coordinate of the area to modify fog of war"
        },
        {
          "name": "floats[0]",
          "description": "The radius (in tiles) around the center point to affect"
        },
        {
          "name": "bools[0]",
          "description": "Whether tiles should be marked as known (true) or unknown (false)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The zone ID to modify. If empty or not provided, uses the current zone."
        }
      ]
    },
    {
      "name": "setGlobalVar",
      "description": "Sets a global variable to either a string or float value. If strings[1] is provided and not empty, uses that string value; otherwise uses floats[0] as the value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "floats[0]",
          "description": "The float value to set the variable to if strings[1] is not provided or is empty"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The string value to set the variable to. If provided and not empty, this takes priority over floats[0]."
        }
      ]
    },
    {
      "name": "setGlobalVar_math",
      "description": "Sets a global variable to the result of a formula calculation. The formula is evaluated and the integer result is used to modify the global variable. The variable is first set to \"0\" then the calculated value is added to it.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "strings[1]",
          "description": "A formula string that will be evaluated to calculate the value to assign to the variable"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarPlusLocID",
      "description": "Sets a global variable with a name that combines strings[0] and the current location ID. This allows creating location-specific global variables. The value is set to floats[0].",
      "required": [
        {
          "name": "strings[0]",
          "description": "The base name for the global variable (the current location ID will be appended to this)"
        },
        {
          "name": "floats[0]",
          "description": "The float value to assign to the location-specific global variable"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarPlusLocID_math",
      "description": "Sets a global variable with a name that combines strings[0] and the current location ID, using a formula to calculate the value. The formula in strings[1] is evaluated and the integer result is added to the location-specific variable (after first setting it to \"0\").",
      "required": [
        {
          "name": "strings[0]",
          "description": "The base name for the global variable (the current location ID will be appended to this)"
        },
        {
          "name": "strings[1]",
          "description": "A formula string that will be evaluated to calculate the value to assign to the variable"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarPlusZoneID",
      "description": "Sets a global variable with a name that combines strings[0] and the current zone ID. This allows creating zone-specific global variables. The value is set to floats[0].",
      "required": [
        {
          "name": "strings[0]",
          "description": "The base name for the global variable (the current zone ID will be appended to this)"
        },
        {
          "name": "floats[0]",
          "description": "The float value to assign to the zone-specific global variable"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarTo0",
      "description": "Sets a global variable to zero (0). This is a convenience task for resetting or initializing a global variable to a zero value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set to 0"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVar_toActorID",
      "description": "Sets a global variable to the ID of the actor associated with this task. Only sets the variable if the actor ID is not empty.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set to the actor's ID"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarToActorProperty",
      "description": "Sets a global variable to the value of a specific property from a specified actor. Retrieves the property value from the actor and converts it to a string for storage in the global variable.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "strings[1]",
          "description": "The ID of the actor to read the property from"
        },
        {
          "name": "strings[2]",
          "description": "The name of the property field to retrieve from the actor"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarToLocID",
      "description": "Sets a global variable to the ID of the current location. Only sets the variable if a current location exists.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set to the current location's ID"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVar_toOtherGlobalVar",
      "description": "Copies the value from one global variable to another. Reads the string value from the source global variable (strings[1]) and assigns it to the destination global variable (strings[0]).",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the destination global variable to set"
        },
        {
          "name": "strings[1]",
          "description": "The name of the source global variable to read from"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVar_toPartyActorID",
      "description": "Sets a global variable to the ID of a party member at a specific index. Only sets the variable if the party has enough members to access the specified index.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "floats[0]",
          "description": "The index of the party member whose ID should be stored (0-based index)"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarToPartyActorNum",
      "description": "Sets a global variable to a numeric value representing a party actor number. This stores floats[0] directly as the value.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "floats[0]",
          "description": "The numeric value to store in the global variable (typically a party member index or count)"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarToTalkerID",
      "description": "Sets a global variable to the ID of the actor currently being talked to. This captures which NPC the player is in conversation with.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set to the current talker's ID"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarToZoneProperty",
      "description": "Sets a global variable to the value of a specific property from the current zone. Retrieves the property value from the zone and converts it to a string for storage. Only works if a current zone exists.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        },
        {
          "name": "strings[1]",
          "description": "The name of the zone property field to retrieve"
        }
      ],
      "optional": []
    },
    {
      "name": "setGlobalVarWithCommas",
      "description": "Sets a global variable to a comma-separated concatenation of multiple string values. Takes strings[1] through the end of the strings array and joins them with commas, storing the result in the variable named by strings[0].",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        }
      ],
      "optional": [
        {
          "name": "strings[1+]",
          "description": "One or more string values that will be joined with commas and stored in the global variable"
        }
      ]
    },
    {
      "name": "setGlobalVarWithTalkerID",
      "description": "Sets a global variable with a name that combines strings[0] and the current talker's actor ID. The value is either strings[1] (if provided and not empty) or floats[0] converted to a string. This creates talker-specific global variables.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The base name for the global variable (the current talker's ID will be appended to this)"
        },
        {
          "name": "floats[0]",
          "description": "The float value to use if strings[1] is not provided or is empty"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The string value to store. If provided and not empty, this takes priority over floats[0]."
        }
      ]
    },
    {
      "name": "set",
      "description": "Sets a global variable to a specified value. Can set the variable to a string value, a float value, or default to \"1\" if no value is provided. If strings[2] is provided, it concatenates strings[1] and strings[2] with a space. After setting the variable, it refreshes the royal quest system.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the global variable to set"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "The string value to set the variable to. If empty and floats[0] exists, uses the float value instead. If strings[2] is provided, a space and strings[2] will be appended to this value."
        },
        {
          "name": "strings[2]",
          "description": "Additional string content to append to strings[1] with a space separator"
        },
        {
          "name": "floats[0]",
          "description": "The float value to set the variable to, used only if strings[1] is not provided or is empty"
        }
      ]
    },
    {
      "name": "setk",
      "description": "Sets or modifies the kill count for a specific actor type. If the actor type doesn't exist in the kill count dictionary, it's added with a value of 0 then incremented. If strings[1] is provided and not empty, it directly sets the kill count to that parsed value instead of incrementing.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The actor type ID to track kills for"
        },
        {
          "name": "strings[1]",
          "description": "The specific kill count value to set. If empty, increments the current count by 1 instead."
        }
      ],
      "optional": []
    },
    {
      "name": "setLocDiscoverable",
      "description": "Marks a specific location as discoverable on the world map. Once set, the location can be found and revealed by the player through normal exploration or other game mechanics.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The location ID to mark as discoverable"
        }
      ],
      "optional": []
    },
    {
      "name": "setMainMenuUIVisible",
      "description": "Controls the visibility of the main menu UI. Can show or hide the main menu, and optionally enable drawing of the main menu background and UI manager based on bools[1].",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to show (true) or hide (false) the main menu UI"
        },
        {
          "name": "bools[1]",
          "description": "If true, also enables drawing of the main menu background and UI manager"
        }
      ],
      "optional": []
    },
    {
      "name": "setMoney",
      "description": "Sets the player's money to a specific amount. If strings[0] is empty, uses floats[0] directly; otherwise evaluates strings[0] as a formula to calculate the money amount.",
      "required": [
        {
          "name": "strings[0]",
          "description": "A formula string to calculate the money amount. If empty, floats[0] is used instead."
        },
        {
          "name": "floats[0]",
          "description": "The money amount to set, used only if strings[0] is empty"
        }
      ],
      "optional": []
    },
    {
      "name": "setMyNodeIf",
      "description": "Conditionally sets the dialog node ID for the actor associated with this task based on a formula evaluation. The dialog node is only changed if the formula evaluates to 1 or greater. This allows dynamic dialog routing based on conditions.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the actor if the condition is met"
        },
        {
          "name": "strings[1]",
          "description": "A formula that is evaluated against the actor. If the result is >= 1, the dialog node is changed."
        }
      ],
      "optional": []
    },
    {
      "name": "setMyNode",
      "description": "Sets the dialog node ID for the actor associated with this task. If a node ID is provided in strings[0], it uses that value; otherwise, it defaults to the current dialog node ID. This controls which dialog conversation the actor will use when interacted with.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the actor. If not provided, uses the current dialog node ID instead."
        }
      ]
    },
    {
      "name": "setNodeIDGlobalVar_1",
      "description": "Sets a global variable named after the current dialog node ID to the value 1, but only if it's not already set to 1. This is used to track whether a particular dialog node has been visited.",
      "required": [],
      "optional": []
    },
    {
      "name": "setNPCDialogWindowSizeY",
      "description": "Sets the vertical size of the NPC dialog window. If a float value is provided, it uses that value; otherwise it uses the last float in the floats array. The window is resized to the specified height.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The height value for the NPC dialog window. If not provided, uses the last value in the floats array."
        }
      ]
    },
    {
      "name": "setOnlyNPCDialogWindowSizeY",
      "description": "Sets the vertical size of the NPC dialog window. If a float value is provided, it uses that value; otherwise it uses the last float in the floats array. The window is resized to the specified height.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The height value for the NPC dialog window. If not provided, uses the last value in the floats array."
        }
      ]
    },
    {
      "name": "setPartyActorAsVendor",
      "description": "Removes a party member and places them as a vendor NPC at a specific location. The party member is removed from the party and fleet, marked as non-swappable, given a dialog node, and added to reserved actor IDs. If an actor already exists at the target location with the same dialog node, that actor is swapped back into the party. Special handling for questgiver global variable updates.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The index of the party member to convert into a vendor (0-based)"
        },
        {
          "name": "strings[0]",
          "description": "The dialog node ID to assign to the vendor actor"
        },
        {
          "name": "floats[1]",
          "description": "The travel point index where the vendor should be placed"
        }
      ],
      "optional": []
    },
    {
      "name": "setPCDialogWindowSizeY",
      "description": "Sets the vertical size of the player character (PC) dialog window. If a float value is provided, it uses that value; otherwise it uses the last float in the floats array. The window is resized to the specified height.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The height value for the PC dialog window. If not provided, uses the last value in the floats array."
        }
      ]
    },
    {
      "name": "setPrevFacingRot",
      "description": "Sets the previous facing rotation value for the current talker. By default, it uses the actor's current facing rotation, but can be overridden by providing a specific rotation value in strings[0]. This is used to remember which direction an NPC was facing before a dialog interaction.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "A specific rotation value to set as the previous facing rotation. If not provided, uses the actor's current facing rotation."
        }
      ]
    },
    {
      "name": "setRoofDrawNoMatterWhat",
      "description": "Controls whether roofs are always drawn regardless of the camera position or player location. When true, roofs will be rendered even when the camera would normally hide them to show interior areas.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to always draw roofs (true) or use normal roof visibility logic (false)"
        }
      ],
      "optional": []
    },
    {
      "name": "setTerrainType_spriteOffsetModulo",
      "description": "Sets the sprite offset modulo values for a specific terrain type. The X and Y offset modulo values are derived from the tileCoords[0] position. These values affect how terrain sprites are positioned with modular arithmetic.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The terrain type ID to modify"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate whose X and Y values will be used as the sprite offset modulo values"
        }
      ],
      "optional": []
    },
    {
      "name": "setTerrainType_spriteOffsetMult",
      "description": "Sets the sprite offset multiplier values for a specific terrain type. The X and Y offset multiplier values are derived from the tileCoords[0] position. These values affect how terrain sprites are positioned by multiplication.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The terrain type ID to modify"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate whose X and Y values will be used as the sprite offset multiplier values"
        }
      ],
      "optional": []
    },
    {
      "name": "setTerrainTypes_spriteOffsetModulo",
      "description": "Sets the sprite offset modulo values for all terrain types whose IDs start with a specific prefix. The X and Y offset modulo values are derived from the tileCoords[0] position. This allows bulk modification of multiple related terrain types at once.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The prefix that terrain type IDs must start with to be modified"
        },
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate whose X and Y values will be used as the sprite offset modulo values"
        }
      ],
      "optional": []
    },
    {
      "name": "setTileTerrain",
      "description": "Changes the terrain type of a specific tile to a new terrain type. The tile position is specified by tileCoords[0], and visual effects can be controlled with bools[0]. The change is not forced (uses the forceChange=false parameter).",
      "required": [
        {
          "name": "tileCoords[0]",
          "description": "The X and Y coordinates of the tile to change"
        },
        {
          "name": "strings[0]",
          "description": "The new terrain type ID to apply to the tile"
        },
        {
          "name": "bools[0]",
          "description": "Whether to show visual effects when changing the terrain (true = show FX, false = no FX)"
        }
      ],
      "optional": []
    },
    {
      "name": "setupBuyShipDialog",
      "description": "Dynamically creates a dialog node with options to purchase ships available at the current location's shipwright. Clears any existing dialog options for the specified node, then adds an option for each ship type available at the location with preview images, names, tooltips showing stats, and custom window sizing. Adds a final 'Goodbye' option at the bottom. If there are more than 4 ship types, alternates between showing line breaks for formatting.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog node ID to populate with ship purchase options"
        }
      ],
      "optional": []
    },
    {
      "name": "setupCafeFoodDialogOptionsWealth100",
      "description": "Sets up dialog options for a cafe food selection menu, showing available food items from wealthy ports (wealth level >= 100). Creates dialog options showing each available food item with its name, price, and effects, including a basic food option and food from all non-sport wealthy ports. Each option can change the cafe's specialty food when selected.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to populate with cafe food options"
        }
      ],
      "optional": []
    },
    {
      "name": "setupFleetLooting",
      "description": "Prepares looting after a fleet battle by collecting cargo from defeated enemy and assist fleet boats. Gathers all items from boat inventories and boat zones into the enemy fleet's cargo container, processes achievement checks for defeating different fleet types (sea monsters, merchants, battle fleets, elite fleets), and clears the special zone.",
      "required": [],
      "optional": []
    },
    {
      "name": "setupGraveyard",
      "description": "Sets up a graveyard area by spawning all dead party members as petrified statues. Places each dead actor on a platform at the specified tile coordinate, arranging them in a grid pattern (2 tiles apart horizontally, wrapping to new rows after 18 tiles, with a max of 122 corpses). Each corpse is petrified, fully healed, made uncontrollable, and has their inventory dropped.",
      "required": [],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Starting tile coordinate for placing the first corpse; subsequent corpses are arranged in a grid pattern from this point"
        }
      ]
    },
    {
      "name": "setupLocationAsPlayerPort",
      "description": "Converts the current location into a player-owned home port with full amenities. Sets up the port with cafe food, shipwright services (cog, caravel, pinnace), hireable crew (human and scurio), refreshed quests, home icon, and populates the stash with essential items (lifeshards, revive dust, splints, shovel, XP gems, and 3 random action tablets). Also adds ability crests as unlockable items and sets the location's faction loyalty to the player's faction if one exists.",
      "required": [],
      "optional": []
    },
    {
      "name": "setupPartyFromGVars",
      "description": "Rebuilds the party from actor IDs or indices stored in global variables. Clears the current party and creates a new party by retrieving actors from global variables - if the value is numeric, it uses it as a party actor index; otherwise it treats it as an actor ID. This allows dynamic party composition based on saved game state.",
      "required": [
        {
          "name": "strings",
          "description": "Array of global variable names, each containing either a party actor index (numeric) or an actor ID (string) to add to the new party"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneBGFX",
      "description": "Sets the background visual effects ID for the current zone, which determines what ambient effects or animations appear in the background.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Background FX ID to apply to the zone"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneBG",
      "description": "Sets the background terrain type ID for the current zone, which determines the visual appearance of the zone's background layer.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Terrain type ID to use for the zone's background"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneDarkColor",
      "description": "Enables darkness in the zone and sets its darkness color. Optionally updates the camera's darkness color immediately to match the zone setting.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Color name or ID to use for the zone's darkness overlay"
        },
        {
          "name": "bools[0]",
          "description": "Whether to immediately apply the darkness color to the camera (true) or only set the zone property (false)"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneDarkness",
      "description": "Enables darkness in the zone and sets its darkness color. Optionally updates the camera's darkness color immediately to match the zone setting. This is functionally identical to setZoneDarkColor.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Color name or ID to use for the zone's darkness overlay"
        },
        {
          "name": "bools[0]",
          "description": "Whether to immediately apply the darkness color to the camera (true) or only set the zone property (false)"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneDarknessToWorldDarkness",
      "description": "Enables darkness in the zone and sets its darkness color to match the current world/outdoor darkness level based on time of day. Applies special color multiplication if the current location is a port. Optionally updates the camera's darkness color immediately.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to immediately apply the darkness color to the camera (true) or only set the zone property (false)"
        }
      ],
      "optional": []
    },
    {
      "name": "setZonePalettes",
      "description": "Sets color palettes for zone terrain and materials. Can set individual palette types (stone, stoneDark, stoneLight, dirt, dirtDark, grass, grassDark, water, wood, woodDark, or misc1-8) or set all palettes at once if the first string doesn't match a known palette type.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Palette type identifier (e.g., 'stone', 'dirt', 'grass', 'water', 'wood', 'misc1', etc.) or any other value to set all palettes"
        },
        {
          "name": "strings[1]",
          "description": "Palette ID to apply to the specified palette type (or to all palettes if strings[0] doesn't match a known type)"
        }
      ],
      "optional": []
    },
    {
      "name": "setZonePeaceful",
      "description": "Toggles the zone's peaceful status, which controls whether combat is allowed. When set to peaceful, exits combat mode if active and makes all actors invincible. When set to non-peaceful, allows combat and removes peaceful invincibility. Refreshes all actors' peaceful invincible status after the change.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to make the zone peaceful (true) or allow combat (false)"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneRollingPinStyle",
      "description": "Sets whether the zone uses 'rolling pin' style perspective/rendering, which affects how the zone is displayed visually.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to enable (true) or disable (false) rolling pin style rendering for the zone"
        }
      ],
      "optional": []
    },
    {
      "name": "setZoneSongs",
      "description": "Sets the zone's travel and combat music. Configures song IDs, pitch, volume, and combat song delay. Immediately plays the appropriate song based on whether the zone is currently in combat mode. Volume can be set via tileCoords[0].X as a percentage (default 100), and combat delay via tileCoords[0].Y.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Travel song ID to play when not in combat (can be empty string if bools[0] is true to clear the song)"
        },
        {
          "name": "strings[1]",
          "description": "Combat song ID to play during combat (can be empty string if bools[1] is true to clear the song)"
        },
        {
          "name": "floats[0]",
          "description": "Pitch adjustment for both travel and combat songs (0 = normal pitch)"
        },
        {
          "name": "bools[0]",
          "description": "Whether to update the travel song settings even if the song ID is empty"
        },
        {
          "name": "bools[1]",
          "description": "Whether to update the combat song settings even if the song ID is empty"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0].X",
          "description": "Volume as a percentage (e.g., 100 = 100%, 50 = 50%); defaults to 100% if not provided"
        },
        {
          "name": "tileCoords[0].Y",
          "description": "Combat song delay in seconds before the music starts; only used if greater than -1"
        }
      ]
    },
    {
      "name": "sfx",
      "description": "Plays a sound effect by name. Only plays if at least one string parameter is provided.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Sound effect name/ID to play"
        }
      ]
    },
    {
      "name": "showCharstats",
      "description": "Shows the character stats UI panel. Unhides the charstats display and forces it to be shown on screen.",
      "required": [],
      "optional": []
    },
    {
      "name": "showEscFactionWindow",
      "description": "Shows only the faction information panel from the escape menu. Hides the main escape menu and left info panel, shows only the right info panel (faction window), and sets the next dialog to hide the window when it appears.",
      "required": [],
      "optional": []
    },
    {
      "name": "showFleetInfo",
      "description": "Generates and displays a dialog showing information about all boats in the actor's fleet. Creates dialog options for each boat with its stats, allowing the player to view detailed boat information. The dialog includes boat type icons, names, and tooltips with full boat stats descriptions.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Dialog node ID to populate with fleet information and boat viewing options"
        }
      ],
      "optional": []
    },
    {
      "name": "showQuickslots",
      "description": "Shows the quickslots UI panel. Unhides the quickslots display, makes the UI visible, and forces the quickslots to be shown on screen.",
      "required": [],
      "optional": []
    },
    {
      "name": "song",
      "description": "Plays or stops background music with control over volume, pitch, delay, and looping. Can play the zone's travel or combat song by using 'travelSong'/'travel' or 'combatSong'/'combat' as the song name. Supports overriding travel song changes and instant playback. Volume is set via tileCoords[0].X as percentage, delay via tileCoords[0].Y.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Song ID to play (use 'travelSong'/'travel' for zone travel song, 'combatSong'/'combat' for zone combat song, or empty string to stop music)"
        },
        {
          "name": "tileCoords[0].X",
          "description": "Volume as a percentage (e.g., 100 = 100%, 50 = 50%); defaults to 100% if not provided"
        },
        {
          "name": "tileCoords[0].Y",
          "description": "Delay in seconds before the music starts (use -99 or set bools[1]=true for instant playback); defaults to 0"
        },
        {
          "name": "bools[0]",
          "description": "Whether this song should override travel song changes (prevents auto-switching when traveling)"
        },
        {
          "name": "floats[0]",
          "description": "Pitch adjustment for the song (0 = normal pitch); defaults to 0"
        },
        {
          "name": "bools[1]",
          "description": "Whether to play instantly with no delay (sets delay to -99)"
        }
      ]
    },
    {
      "name": "spawn_actorPrefab",
      "description": "Spawns an actor from a prefab or spawn data within the trigger area. If spawning a prefab, creates a single actor with specified facing rotation and optional animation. If spawning from spawn data, creates a group of enemies with power level adjustments, positioning them within the specified area or at specific coordinates. Actors face toward the center or player depending on bools settings.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor prefab ID or spawn data ID to spawn"
        },
        {
          "name": "floats[0]",
          "description": "For prefabs: facing rotation in degrees. For spawn data: power level adjustment added to party power level"
        },
        {
          "name": "bools[0]",
          "description": "For prefabs: whether to use the prefab ID as the actor's ID. For spawn data: whether actors should face the center point of the spawn area"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "For prefabs: animation ID to play after spawning. For spawn data: group ID override (defaults to spawn data ID)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to spawn at; if not provided, spawns at random location within trigger area"
        },
        {
          "name": "bools[1]",
          "description": "For spawn data: whether spawned actors should look at the player"
        }
      ]
    },
    {
      "name": "spawn_actorPrefab_point",
      "description": "Spawns an actor from a prefab or spawn data, with prefabs using travel point positioning. Identical to spawn_actorPrefab, but when spawning a prefab, the tileCoords determine which travel point to use for positioning and rotation. For spawn data, behaves the same as spawn_actorPrefab.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor prefab ID or spawn data ID to spawn"
        },
        {
          "name": "floats[0]",
          "description": "For prefabs: facing rotation (overridden by travel point rotation). For spawn data: power level adjustment added to party power level"
        },
        {
          "name": "bools[0]",
          "description": "For prefabs: whether to use the prefab ID as the actor's ID. For spawn data: whether actors should face the center point of the spawn area"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "For prefabs: animation ID to play after spawning. For spawn data: group ID override (defaults to spawn data ID)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Travel point coordinates (X and Y used to determine which travel point); if not provided for spawn data, spawns at random location"
        },
        {
          "name": "bools[1]",
          "description": "For spawn data: whether spawned actors should look at the player"
        }
      ]
    },
    {
      "name": "spawn_actorPrefab_point_specialZone",
      "description": "Spawns an actor prefab in the special zone at a specific travel point from a travel point set. The actor is positioned and rotated according to the travel point, fully healed, and all effects cleared. Only works when a special zone exists and the prefab is valid.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor prefab ID to spawn"
        },
        {
          "name": "bools[0]",
          "description": "Whether to use the prefab ID as the spawned actor's ID"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Animation ID to play after spawning"
        },
        {
          "name": "tileCoords[0].X",
          "description": "Index of which travel point to use from the travel point set (0-based)"
        },
        {
          "name": "tileCoords[0].Y",
          "description": "Travel point set identifier (used with value 0 to get the travel point set)"
        }
      ]
    },
    {
      "name": "spawn_corpse",
      "description": "Spawns a random corpse from the party's dead actors list, tracking which corpses have been spawned using global variables 'spawnedCorpse1' and 'spawnedCorpse2'. Only spawns if there are corpses available and fewer than 2 have already been spawned. Avoids spawning the same corpse twice.",
      "required": [],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to spawn the corpse at; if not provided (X=-1), spawns at the center of the trigger area"
        }
      ]
    },
    {
      "name": "spawn_fleet",
      "description": "Spawns a fleet at a specified location using spawn data. Creates a fleet with merchant and elite status flags, faction override from spawn data, and power level adjustment. The fleet does not use standard AI behavior.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Spawn data ID to use for creating the fleet"
        },
        {
          "name": "bools[0]",
          "description": "Whether the fleet is a merchant fleet"
        },
        {
          "name": "bools[1]",
          "description": "Whether the fleet is an elite fleet"
        },
        {
          "name": "floats[0]",
          "description": "Power level for the fleet"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Additional spawn parameter (passed to fleet spawn function)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Tile coordinate where the fleet should spawn"
        }
      ]
    },
    {
      "name": "spawn_g",
      "description": "Spawns actors using a spawn data ID stored in a global variable. Retrieves the spawn data ID from the specified global variable and executes a spawn task with the retrieved ID. Allows dynamic spawning based on saved game state.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Global variable name containing the spawn data ID to use"
        },
        {
          "name": "floats[0]",
          "description": "Power level adjustment added to party power level"
        },
        {
          "name": "bools[0]",
          "description": "Whether actors should face the center point of the spawn area"
        },
        {
          "name": "bools[1]",
          "description": "Whether spawned actors should look at the player"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Group ID override (defaults to spawn data ID)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to spawn at; if not provided, spawns at random location within trigger area"
        }
      ]
    },
    {
      "name": "spawn_g_nearPlayer",
      "description": "Spawns actors near the player using a spawn data ID stored in a global variable. Retrieves the spawn data ID from the specified global variable and executes a spawn task in a 3x3 area around the player's position. If bools[1] is true, spawns behind the player instead of at their position.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Global variable name containing the spawn data ID to use"
        },
        {
          "name": "floats[0]",
          "description": "Power level adjustment added to party power level"
        },
        {
          "name": "bools[0]",
          "description": "Whether actors should face the center point of the spawn area"
        },
        {
          "name": "bools[1]",
          "description": "Whether to spawn behind the player (3 tiles in opposite direction of facing)"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Group ID override (defaults to spawn data ID)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Additional spawn parameters (passed to spawn task but origin is always near player)"
        }
      ]
    },
    {
      "name": "spawnItem",
      "description": "Spawns an item on the ground at a specified location or randomly within the trigger area. Can spawn items by ID or from a global variable containing an item ID. Optionally shows a visual effect when the item appears and can use travel points for positioning.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Item type ID to spawn, or global variable name containing the item type ID if the ID doesn't exist in item types"
        },
        {
          "name": "bools[0]",
          "description": "Whether to show the item with a visual pop effect when spawned"
        }
      ],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Quantity of items to spawn (defaults to 1 if not provided or if <= 0)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to spawn at; if not provided, spawns at random occupiable location within trigger area"
        },
        {
          "name": "bools[1]",
          "description": "Whether to use tileCoords as a travel point reference instead of direct coordinates"
        },
        {
          "name": "strings[1]",
          "description": "Visual effect ID to play at the spawn location (in white color)"
        }
      ]
    },
    {
      "name": "spawn",
      "description": "Spawns an actor from a prefab or spawn data within the trigger area. If spawning a prefab, creates a single actor with specified facing rotation and optional animation. If spawning from spawn data, creates a group of enemies with power level adjustments, positioning them within the specified area or at specific coordinates. Actors face toward the center or player depending on bools settings. Functionally identical to spawn_actorPrefab.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor prefab ID or spawn data ID to spawn"
        },
        {
          "name": "floats[0]",
          "description": "For prefabs: facing rotation in degrees. For spawn data: power level adjustment added to party power level"
        },
        {
          "name": "bools[0]",
          "description": "For prefabs: whether to use the prefab ID as the actor's ID. For spawn data: whether actors should face the center point of the spawn area"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "For prefabs: animation ID to play after spawning. For spawn data: group ID override (defaults to spawn data ID)"
        },
        {
          "name": "tileCoords[0]",
          "description": "Specific tile coordinate to spawn at; if not provided, spawns at random location within trigger area"
        },
        {
          "name": "bools[1]",
          "description": "For spawn data: whether spawned actors should look at the player"
        }
      ]
    },
    {
      "name": "spawn_location",
      "description": "Spawns NPCs from the current location's auto-spawn data list. The number of spawn groups increases with location wealth (1 group normally, 2 if wealth > 60, 3 if wealth > 999). Randomly selects spawn data from the location's list, creates actors, and places them on travel points. Also applies special player port spawns if the player owns a home.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract300gp",
      "description": "Subtracts 300 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract30gp",
      "description": "Subtracts 30 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract350gp",
      "description": "Subtracts 350 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract400gp",
      "description": "Subtracts 400 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract40gp",
      "description": "Subtracts 40 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract5000gp",
      "description": "Subtracts 5000 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract500gp",
      "description": "Subtracts 500 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract50gp",
      "description": "Subtracts 50 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract60gp",
      "description": "Subtracts 60 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract75gp",
      "description": "Subtracts 75 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtract800gp",
      "description": "Subtracts 800 gold pieces from the player's money. This is a fixed amount deduction commonly used for specific quest costs or purchases.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtractAllgp",
      "description": "Sets the player's money to zero, effectively removing all gold pieces. This completely empties the player's wallet.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtractBribeAmount",
      "description": "Calculates a bribe amount based on the actor's combat group power level (14% of power level), subtracts that amount from the player's money, and gives the gold to the actor's inventory. This is used for bribery mechanics where the cost is dynamically calculated.",
      "required": [],
      "optional": []
    },
    {
      "name": "subtractgp",
      "description": "Subtracts a variable amount of gold pieces from the player's money. The amount can be specified either as a formula string or as a numeric value. The formula is calculated and floored to an integer before subtraction.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Formula string to calculate the amount of gold to subtract. Used if provided, otherwise floats[0] is used"
        },
        {
          "name": "floats[0]",
          "description": "Numeric amount of gold to subtract. Only used if strings is empty"
        }
      ]
    },
    {
      "name": "talk",
      "description": "Initiates a conversation with an actor or displays a dialog node with no actor. If the actor ID is empty or invalid, it shows a dialog without an NPC. Otherwise, it starts a conversation with the specified actor using the given dialog node.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Actor ID to talk to. If empty or the actor doesn't exist, displays dialog without an NPC"
        },
        {
          "name": "strings[1]",
          "description": "Dialog node ID to display or start the conversation with"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable camera pointing between player and NPC (inverted: false means camera points, true means it doesn't)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to position the dialog at the bottom of the screen instead of using tileCoords Y position"
        }
      ],
      "optional": []
    },
    {
      "name": "talkToCommodore",
      "description": "Initiates a conversation with the commodore of the actor's fleet. This retrieves the commodore's ID from the fleet and starts a dialog with them if not already talking to them.",
      "required": [],
      "optional": []
    },
    {
      "name": "talkToFirstMate",
      "description": "Initiates a conversation with the first mate of the player's crew. This retrieves the first mate's ID from the global variable 'firstmate' and starts a dialog with them if not already talking to them.",
      "required": [],
      "optional": []
    },
    {
      "name": "talkToFlagship",
      "description": "Initiates a conversation with the flagship of the actor's fleet. If the fleet has no faction, it shows silent dialog. Special handling for the 'lagan' commodore converts them to a pirate faction. Otherwise, it talks to the flagship actor using the current dialog node.",
      "required": [],
      "optional": []
    },
    {
      "name": "talkToOtherActor",
      "description": "Initiates a conversation with another actor at the same tile position as the task's actor. It prioritizes non-incapacitated actors and excludes the task's own actor ID when searching for someone to talk to.",
      "required": [],
      "optional": []
    },
    {
      "name": "task_gvar",
      "description": "Executes a task whose type is stored in a global variable. The global variable name is specified, and if its value is not '0', a new task is created with that type and executed immediately.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Name of the global variable containing the task type to execute"
        }
      ],
      "optional": []
    },
    {
      "name": "tc",
      "description": "Toggles combat mode on or off globally. This is a debug/testing task that enables or disables the combat system and displays a debug message showing the current state.",
      "required": [],
      "optional": []
    },
    {
      "name": "tcui",
      "description": "Toggles the visibility of the combat UI. This is a debug/testing task that shows or hides all combat interface elements.",
      "required": [],
      "optional": []
    },
    {
      "name": "tdm",
      "description": "Toggles the display of damage numbers. This is a debug/testing task that shows or hides floating damage numbers during combat.",
      "required": [],
      "optional": []
    },
    {
      "name": "test2",
      "description": "An empty test task that does nothing. This appears to be a placeholder or dummy task used for development testing purposes.",
      "required": [],
      "optional": []
    },
    {
      "name": "testboatanim",
      "description": "Returns to the previous input mode and triggers boarding special zone timers. This is a debug/testing task for testing boat animations and boarding sequences.",
      "required": [],
      "optional": []
    },
    {
      "name": "testitemload",
      "description": "A debug task that spawns items on every tile in the current zone. By default it spawns 'toyboat' items, but can be configured to spawn any item type. This is used for testing item loading and rendering performance.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Item ID to spawn on every tile. Defaults to 'toyboat' if not provided"
        }
      ]
    },
    {
      "name": "test",
      "description": "A debug test task that performs regex replacement on formula strings. It schedules a 'test2' task to run after 1 second, then demonstrates replacing 'd:sword' with 'beans' in a test string and displays the result.",
      "required": [],
      "optional": []
    },
    {
      "name": "testskillcost",
      "description": "A debug task that calculates and displays skill costs using a formula. It requires three values (base, increment, multiplier) and computes costs for 12 levels using the formula: (base + level * increment) * multiplier^level. The results are displayed as a comma-separated list.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Base cost value for the skill"
        },
        {
          "name": "floats[1]",
          "description": "Increment value added per level"
        },
        {
          "name": "floats[2]",
          "description": "Multiplier raised to the power of the level"
        }
      ],
      "optional": []
    },
    {
      "name": "testzones",
      "description": "A debug task that automatically travels through all zone files not in the level data dictionary. It filters out special zones (sp, grove, den, bz prefixes) and creates a series of travel_point tasks to visit each zone, displaying progress as damage numbers. This is used for testing zone loading.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Maximum number of zones to test in a single run. If not provided, tests all zones"
        },
        {
          "name": "floats[1]",
          "description": "Number of times to repeat the entire test sequence. Defaults to 1 if not provided"
        }
      ]
    },
    {
      "name": "textOverlay_dynamic",
      "description": "Displays an overlay text message with dynamic character-by-character reveal animation. The text appears gradually with customizable positioning and transparency. X and Y offsets default to 0 if not provided via tileCoords.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Text message to display in the overlay with dynamic reveal"
        },
        {
          "name": "floats[0]",
          "description": "Alpha color value (0-255) for text transparency"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable horizontal centering (inverted: false centers the text, true doesn't)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to disable vertical centering (inverted: false centers the text, true doesn't)"
        }
      ],
      "optional": []
    },
    {
      "name": "textOverlay",
      "description": "Displays an overlay text message on the screen with customizable positioning and transparency. The text can be centered or offset, and supports alpha transparency. The Y offset is always set to 0 regardless of input.",
      "required": [
        {
          "name": "bools[0]",
          "description": "Whether to disable horizontal centering (inverted: false centers the text, true doesn't)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to disable vertical centering (inverted: false centers the text, true doesn't)"
        }
      ],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Text message to display in the overlay. Defaults to empty string if not provided"
        },
        {
          "name": "floats[0]",
          "description": "Alpha color value (0-255) for text transparency. Defaults to 0 (fully transparent) if not provided"
        }
      ]
    },
    {
      "name": "textOverlay_tween",
      "description": "Displays an overlay text message with a smooth tween animation. The text animates onto the screen with customizable positioning and transparency. X and Y offsets default to 0 if not provided via tileCoords.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Text message to display in the overlay with tween animation. Defaults to empty string if not provided"
        },
        {
          "name": "floats[0]",
          "description": "Alpha color value (0-255) for text transparency. Defaults to 0 (fully transparent) if not provided"
        }
      ]
    },
    {
      "name": "tfl",
      "description": "Toggles the FPS (frames per second) limit on or off. This is a debug/testing task that enables or disables the frame rate cap, useful for performance testing.",
      "required": [],
      "optional": []
    },
    {
      "name": "time",
      "description": "Advances the in-game world time by a specified amount. This adds the given value to the world time and refreshes the travel info window to reflect the time change.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Amount of time to add to the world time"
        }
      ],
      "optional": []
    },
    {
      "name": "timeSpeed",
      "description": "Sets the game's time speed multiplier. This controls how fast time passes in the game, with values like 1.0 for normal speed, 2.0 for double speed, 0.5 for half speed, etc.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Time speed multiplier value to set"
        }
      ],
      "optional": []
    },
    {
      "name": "tMapTest",
      "description": "A debug task that generates map screenshots of special zones in a grid pattern. It loads the 'eral' special zone, clears actors and certain items, then recursively takes 32x32 tile screenshots starting at a given position, moving right and wrapping down when reaching x=700. Used for generating map tiles.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "Starting X coordinate for the screenshot. Defaults to 100 if not provided"
        },
        {
          "name": "floats[1]",
          "description": "Starting Y coordinate for the screenshot. Defaults to 100 if not provided"
        }
      ]
    },
    {
      "name": "tm",
      "description": "Toggles the visibility of game menus. This is a debug/testing task that shows or hides all menu interface elements.",
      "required": [],
      "optional": []
    },
    {
      "name": "togglePause",
      "description": "Toggles the pause state of actors and actions in the game. When paused, all actor movement and actions are frozen. When unpaused, they resume normally.",
      "required": [],
      "optional": []
    },
    {
      "name": "tq",
      "description": "Toggles the visibility of quick slots and character stats UI. This is a debug/testing task that shows or hides the quick slot bar and character statistics display.",
      "required": [],
      "optional": []
    },
    {
      "name": "travel_g",
      "description": "Travels to a zone specified by the global variable 'lastProcZoneEntry'. If in combat, asks about fleeing. Otherwise, autosaves and moves to the zone retrieved from the global variable with the specified fade duration.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Fade duration in seconds for the transition"
        }
      ],
      "optional": []
    },
    {
      "name": "travel_gVars",
      "description": "Travels to a zone and position specified by global variables. Uses 'playerPrevZone' for the zone ID and 'playerX'/'playerY' for coordinates. If in combat, asks about fleeing. Otherwise, travels to the stored location with autosave unless disabled.",
      "required": [
        {
          "name": "floats[0]",
          "description": "Fade duration in seconds for the transition"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving before travel (inverted: false allows autosave, true prevents it)"
        }
      ],
      "optional": []
    },
    {
      "name": "travel",
      "description": "Travels to a specified zone with optional coordinates and fade duration. If currently in combat mode, it asks about fleeing instead. If in action mode, the travel is prevented. Otherwise, it initiates travel to the target zone with autosave unless disabled.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Fade duration in seconds for the transition"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving before travel (inverted: false allows autosave, true prevents it)"
        }
      ],
      "optional": []
    },
    {
      "name": "travel_leaveLocation",
      "description": "Exits the current location and returns to the overworld or previous zone. If in combat, asks about fleeing. The return coordinates can be specified via tileCoords, or default to (0,0) if not provided and autosave is disabled.",
      "required": [],
      "optional": [
        {
          "name": "bools[0]",
          "description": "Whether coordinates are provided (true means tileCoords specify return position, false uses default)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to disable autosaving when leaving (inverted: false allows autosave, true prevents it)"
        }
      ]
    },
    {
      "name": "travel_noSave",
      "description": "Travels to a specified zone without autosaving. If in combat, asks about fleeing. Otherwise, it directly moves to the new zone with the specified fade duration, bypassing the normal autosave mechanism.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Fade duration in seconds for the transition"
        }
      ],
      "optional": []
    },
    {
      "name": "travel_point_g",
      "description": "Travels to a specific point within a zone, where the zone ID is retrieved from a global variable. Uses special coordinate format (-99, pointID) for point-based travel. If in combat, asks about fleeing. Supports optional autosave disabling and console entry mode.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Name of the global variable containing the zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Point ID number within the zone to travel to"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving before travel (inverted: false allows autosave, true prevents it)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to mark this as entering via console (enables special console entry mode if true)"
        }
      ]
    },
    {
      "name": "travel_point",
      "description": "Travels to a specific point ID within a zone. Uses a special coordinate format (-99, pointID) to indicate point-based travel. If in combat, asks about fleeing. Supports optional autosave disabling and console entry mode.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Point ID number within the zone to travel to"
        }
      ],
      "optional": [
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving before travel (inverted: false allows autosave, true prevents it)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to mark this as entering via console (enables special console entry mode if true)"
        }
      ]
    },
    {
      "name": "travel_procedural",
      "description": "Creates and travels to a procedurally generated world/dungeon. The world type and destination are specified, with optional return coordinates. The destination can include a comma-separated bottom exit override. Return coordinates can come from tileCoords or be centered on the trigger area.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Procedural world type/template to generate"
        },
        {
          "name": "strings[1]",
          "description": "End destination zone (and optional bottom exit override, comma-separated)"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving (inverted: false allows autosave, true prevents it)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to use centered trigger area coordinates as return position instead of tileCoords"
        }
      ],
      "optional": []
    },
    {
      "name": "travel_procedural_point",
      "description": "Creates and travels to a procedurally generated world at a specific point. Similar to travel_procedural but also accepts a point ID for the destination. The world type and destination are specified, with optional return coordinates and bottom exit override.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Procedural world type/template to generate"
        },
        {
          "name": "strings[1]",
          "description": "End destination zone (and optional bottom exit override, comma-separated)"
        },
        {
          "name": "floats[0]",
          "description": "Point ID number within the destination zone"
        },
        {
          "name": "bools[0]",
          "description": "Whether to disable autosaving (inverted: false allows autosave, true prevents it)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to use centered trigger area coordinates as return position instead of tileCoords"
        }
      ],
      "optional": []
    },
    {
      "name": "travel_setReturnPath",
      "description": "Travels to a zone while setting a return path for later use. If in combat, asks about fleeing. Otherwise, autosaves and moves to the zone, storing the return coordinates either from tileCoords or centered on the trigger area for future return travel.",
      "required": [
        {
          "name": "strings[0]",
          "description": "Zone ID to travel to"
        },
        {
          "name": "floats[0]",
          "description": "Fade duration in seconds for the transition"
        },
        {
          "name": "bools[0]",
          "description": "Whether to use centered trigger area coordinates as return position instead of tileCoords"
        }
      ],
      "optional": []
    },
    {
      "name": "triggerEffect",
      "description": "Schedules a trigger effect to execute after a delay. This task has two modes: a simple mode that takes a delay and effect name, or an extended mode with multiple timing and parameter configurations. The extended mode allows specifying effect names, delays, and additional parameters for more complex trigger effect timing.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "In simple mode (when strings.Count <= 5): delay in seconds before executing the trigger effect. In extended mode: first timing parameter parsed from strings[0]"
        },
        {
          "name": "strings[0]",
          "description": "In simple mode: the trigger effect name/ID to execute. In extended mode: first timing value as string (converted to float)"
        },
        {
          "name": "strings[1]",
          "description": "Extended mode only: the trigger effect name/ID to execute"
        },
        {
          "name": "strings[2]",
          "description": "Extended mode only: second timing parameter as string (converted to float)"
        },
        {
          "name": "strings[3]",
          "description": "Extended mode only: additional parameter for the trigger effect"
        },
        {
          "name": "strings[4]",
          "description": "Extended mode only: third timing parameter as string (converted to float)"
        }
      ]
    },
    {
      "name": "trigger",
      "description": "Executes a trigger by ID, index, or from global triggers. Optionally evaluates a formula condition before execution. Can bypass trigger requirement checks and consumable/dialog checks. Supports both zone-local and global triggers.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Trigger ID to execute. Searches zone triggers first, then global triggers. If empty, uses floats[0] as index"
        },
        {
          "name": "strings[1]",
          "description": "Optional formula condition that must evaluate to greater than 0 for the trigger to execute"
        },
        {
          "name": "floats[0]",
          "description": "Trigger index in the zone's trigger list. Only used if strings[0] is empty"
        },
        {
          "name": "bools[0]",
          "description": "Whether to bypass trigger requirement checks (true skips checkIfCanTrigger)"
        },
        {
          "name": "bools[1]",
          "description": "Whether to skip consumable and dialog checks within checkIfCanTrigger (inverted: false checks, true skips)"
        }
      ]
    },
    {
      "name": "tryDialog_commodore",
      "description": "Attempts to start a dialog with the specified ID and if successful, points the camera at the enemy flagship (commodore) with a special effect. This is used for naval encounters where the enemy commodore initiates dialog. An exclamation visual effect is added to the flagship position.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog ID to attempt to start"
        }
      ],
      "optional": []
    },
    {
      "name": "tryDialog",
      "description": "Attempts to start a dialog with the specified ID. If successful and a tile coordinate is provided, the camera will point to that location with a fixed view. This is used for triggering story dialogs or NPC conversations.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The dialog ID to attempt to start"
        }
      ],
      "optional": [
        {
          "name": "tileCoords[0]",
          "description": "The tile coordinate to point the camera at if the dialog starts successfully"
        }
      ]
    },
    {
      "name": "trySetAchievement",
      "description": "Sets a global variable and attempts to unlock a Steam achievement with the specified ID. The global variable is set to 1.0 without triggering achievement checks (to prevent recursion), and then the Steam API is called if available to unlock the achievement and store stats.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The achievement ID to unlock (also used as the global variable name)"
        }
      ],
      "optional": []
    },
    {
      "name": "tt",
      "description": "Toggles the display of tooltips in the game UI. This is a debug/developer command that switches between showing and hiding tooltips globally.",
      "required": [],
      "optional": []
    },
    {
      "name": "tw",
      "description": "Toggles the display of debug wires in the camera view. This is a debug/developer command that shows or hides visual debug information like collision boundaries or pathfinding data.",
      "required": [],
      "optional": []
    },
    {
      "name": "UIPartInputCommand",
      "description": "Handles UI part input commands with optional parameters. This task has two modes: a simple mode that takes only an action string, or an extended mode that includes additional parameters for more complex UI interactions. The extended mode is used when sufficient parameters are provided (at least 3 strings and 2 floats).",
      "required": [
        {
          "name": "strings[0]",
          "description": "The action/command to execute on the UI part"
        }
      ],
      "optional": [
        {
          "name": "strings[1]",
          "description": "Extended mode only: the name parameter for the UI command"
        },
        {
          "name": "floats[0]",
          "description": "Extended mode only: the ID number parameter for the UI command"
        },
        {
          "name": "strings[2]",
          "description": "Extended mode only: the value parameter for the UI command"
        },
        {
          "name": "floats[1]",
          "description": "Extended mode only: the float value parameter for the UI command"
        }
      ]
    },
    {
      "name": "unlockExtras",
      "description": "Unlocks extra game features including bonus races/actor types and extra options. This adds all player-unlockable actor types to the available pool, sets unlock flags, triggers a completion achievement, and saves the configuration to disk. This is typically used for game progression milestones or rewards.",
      "required": [],
      "optional": []
    },
    {
      "name": "unlockGem",
      "description": "Unlocks and enables the help gem feature for the player. If this is the first time unlocking, visual effects (super sparkles and a positive aura sound) are played at the player's position. The gem becomes immediately usable with no cooldown timer.",
      "required": [],
      "optional": []
    },
    {
      "name": "unlockHelpGem",
      "description": "Unlocks and enables the help gem feature for the player without visual effects. The gem becomes immediately usable with no cooldown timer. This is a simpler version of the unlockGem task.",
      "required": [],
      "optional": []
    },
    {
      "name": "uploadmod",
      "description": "Uploads a mod to the Steam Workshop. This validates the specified mod folder, initiates the Steam Workshop item creation process, and displays a progress dialog to the user. Player interaction is prevented during the upload process.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The name of the mod folder to upload to Steam Workshop"
        }
      ],
      "optional": []
    },
    {
      "name": "weather",
      "description": "Sets the current weather to the specified weather type. This changes the global weather state which affects visuals, gameplay mechanics, and environmental effects.",
      "required": [
        {
          "name": "strings[0]",
          "description": "The weather type name to set. Must be one of: none, rain, storm, snow, gale, krill"
        }
      ],
      "optional": []
    },
    {
      "name": "wind",
      "description": "Sets the wind rotation/direction to the specified angle. This affects sailing mechanics and wind-based gameplay elements.",
      "required": [
        {
          "name": "floats[0]",
          "description": "The wind rotation angle in degrees"
        }
      ],
      "optional": []
    },
    {
      "name": "win",
      "description": "Immediately ends the current combat encounter as a victory. This forces the combat to end with the player victorious (not fleeing) regardless of the current combat state.",
      "required": [],
      "optional": []
    },
    {
      "name": "w",
      "description": "Creates and enters a procedural world with the specified level data ID. This is an alias for the 'world' task. The game validates that the level data exists, generates the procedural world, and loads the starting zone at coordinates 0,0 with the player spawning at tile position (12, 12).",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The level data ID to use for generating the procedural world (must exist in Data.levelData)"
        }
      ]
    },
    {
      "name": "world",
      "description": "Creates and enters a procedural world with the specified level data ID. The game validates that the level data exists, generates the procedural world, and loads the starting zone at coordinates 0,0 with the player spawning at tile position (12, 12).",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "The level data ID to use for generating the procedural world (must exist in Data.levelData)"
        }
      ]
    },
    {
      "name": "xpall",
      "description": "Awards experience points to all party members for all selectable classes. This is a debug/cheat command that grants XP across every available class for every party actor. If no amount is specified, defaults to 9999 XP.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The amount of XP to award to each class for each party member (defaults to 9999 if not specified)"
        }
      ]
    },
    {
      "name": "xpcost",
      "description": "Debug command that calculates and displays the total XP cost for all actions in each selectable actor class. This sums up all XP costs for all actions available to each class and outputs the results for debugging or balancing purposes.",
      "required": [],
      "optional": []
    },
    {
      "name": "xpcosts",
      "description": "Debug command that calculates and displays the total XP cost for all actions in each selectable actor class. This sums up all XP costs for all actions available to each class and outputs the results for debugging or balancing purposes. This is an alias for the 'xpcost' task.",
      "required": [],
      "optional": []
    },
    {
      "name": "xp",
      "description": "Awards experience points to all party members for their current/default class. This is a debug/cheat command that grants XP to every party actor. If no amount is specified, defaults to 9999 XP.",
      "required": [],
      "optional": [
        {
          "name": "floats[0]",
          "description": "The amount of XP to award to each party member (defaults to 9999 if not specified)"
        }
      ]
    },
    {
      "name": "z",
      "description": "Debug command that lists all zone PNG files in the ZoneData directory that don't match existing level data keys. This helps identify orphaned or custom zone files. Can optionally filter results to only show zones starting with 'z' followed by a specific string.",
      "required": [],
      "optional": [
        {
          "name": "strings[0]",
          "description": "Optional filter string - if provided, only shows zone files starting with 'z' followed by this string (case-insensitive)"
        }
      ]
    }
  ]
}
